Repository: authoress/bs4ru
Catalog: doc_bs4_4.13.3/locale/*/LC_MESSAGES/bs4ru.po
Languages: ru

source: If you pass one of the ``find*`` methods both :ref:`string <string>` *and* a tag-specific argument like :ref:`name <name>`, Beautiful Soup will search for tags that match your tag-specific criteria and whose :ref:`Tag.string <.string>` matches your :ref:`string <string>` value. It will *not* find the strings themselves. Previously, Beautiful Soup ignored the tag-specific arguments and looked for strings.
ru: Если вы передадите в один из методов ``find*`` одновременно :ref:`string <string>` *и* специфичный для тега аргумент, такой как :ref:`name <name>`, Beautiful Soup будет искать теги, которые, во-первых, соответствуют специфичным для тега критериям, и, во-вторых, имеют :ref:`Tag.string <.string>`, соответствующий заданному вами значению :ref:`string <string>`. Beautiful Soup *не* найдет сами строки. Ранее Beautiful Soup игнорировал аргументы, специфичные для тегов, и искал строки.

source: The :py:class:`BeautifulSoup` constructor no longer recognizes the ``markupMassage`` argument. It's now the parser's responsibility to handle markup correctly.
ru: Конструктор :py:class:`BeautifulSoup` больше не распознает аргумент `markupMassage`. Теперь это задача парсера — обрабатывать разметку правильно.

source: The rarely-used alternate parser classes like ``ICantBelieveItsBeautifulSoup`` and ``BeautifulSOAP`` have been removed. It's now the parser's decision how to handle ambiguous markup.
ru: Редко используемые альтернативные классы парсеров, такие как ``ICantBelieveItsBeautifulSoup`` и ``BeautifulSOAP``, удалены. Теперь парсер решает, что делать с неоднозначной разметкой.

source: The ``prettify()`` method now returns a Unicode string, not a bytestring.
ru: Метод ``prettify()`` теперь возвращает строку Unicode, а не байтовую строку.
