Repository: authoress/bs4ru
Catalog: doc_bs4_4.13.3/locale/*/LC_MESSAGES/bs4ru.po
Languages: ru

source: Beautiful Soup Documentation
ru: Документация Beautiful Soup

source: "The Fish-Footman began by producing from under his arm a great letter, nearly as large as himself."
ru: "Лакей Карась начал с того, что вытащил из-под мышки огромный конверт (чуть ли не больше его самого)."

source: `Beautiful Soup <http://www.crummy.com/software/BeautifulSoup/>`_ is a Python library for pulling data out of HTML and XML files. It works with your favorite parser to provide idiomatic ways of navigating, searching, and modifying the parse tree. It commonly saves programmers hours or days of work.
ru: `Beautiful Soup <http://www.crummy.com/software/BeautifulSoup/>`_ — это библиотека Python для извлечения данных из файлов HTML и XML. Она работает с вашим любимым парсером, чтобы дать вам естественные способы навигации, поиска и изменения дерева разбора. Она обычно экономит программистам часы и дни работы.

source: These instructions illustrate all major features of Beautiful Soup 4, with examples. I show you what the library is good for, how it works, how to use it, how to make it do what you want, and what to do when it violates your expectations.
ru: Эти инструкции иллюстрируют все основные функции Beautiful Soup 4 на примерах. Я покажу вам, для чего нужна библиотека, как она работает, как ее использовать, как заставить ее делать то, что вы хотите, и что нужно делать, когда она не оправдывает ваши ожидания.

source: This document covers Beautiful Soup version 4.13.3. The examples in this documentation were written for Python 3.8.
ru: Эта документация относится к Beautiful Soup версии 4.13.3. Примеры в документации приведены для Python 3.8.

source: You might be looking for the documentation for `Beautiful Soup 3 <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_. If so, you should know that Beautiful Soup 3 is no longer being developed and that all support for it was dropped on December 31, 2020. If you want to learn about the differences between Beautiful Soup 3 and Beautiful Soup 4, see `Porting code to BS4`_.
ru: Возможно, вы ищете документацию для `Beautiful Soup 3 <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_. Если это так, имейте в виду, что Beautiful Soup 3 больше не развивается, и что поддержка этой версии прекращена 31 декабря 2020 года. Если вы хотите узнать о различиях между Beautiful Soup 3 и Beautiful Soup 4, читайте раздел `Перенос кода на BS4`_.

source: This documentation has been translated into other languages by Beautiful Soup users:
ru: Эта документация переведена на другие языки пользователями Beautiful Soup:

source: `Эта документация доступна на русском языке. <https://www.crummy.com/software/BeautifulSoup/bs4/doc.ru/>`_
ru: `Эта документация доступна на русском языке. <http://bs4ru.geekwriter.ru>`_

source: Getting help
ru: Техническая поддержка

source: If you have questions about Beautiful Soup, or run into problems, `send mail to the discussion group <https://groups.google.com/forum/?fromgroups#!forum/beautifulsoup>`_. If your problem involves parsing an HTML document, be sure to mention :ref:`what the diagnose() function says <diagnose>` about that document.
ru: Если у вас есть вопросы о Beautiful Soup или возникли проблемы, `отправьте сообщение в дискуссионную группу <https://groups.google.com/forum/?fromgroups#!forum/beautifulsoup>`_. Если ваша проблема связана с разбором HTML-документа, не забудьте упомянуть, :ref:`что говорит о нем функция diagnose() <diagnose>`.

source: When reporting an error in this documentation, please mention which translation you're reading.
ru: Сообщая об ошибке в этой документации, укажите, какой перевод вы читаете.

source: API documentation
ru: Документация API

source: This document is written like an instruction manual, but you can also read :doc:`traditional API documentation <api/modules>` generated from the Beautiful Soup source code. If you want details about Beautiful Soup's internals, or a feature not covered in this document, try the API documentation.
ru: Документ, который вы читаете -- это руководство пользователя. Также вы можете почитать `традиционную документацию API <https://www.crummy.com/software/BeautifulSoup/bs4/doc/api/modules.html>`_, сгенерированную из исходного кода Beautiful Soup. Если вам нужны подробности о внутренних компонентах Beautiful Soup или о функциях, не описанных в этом документе, попробуйте найти их в документации API.

source: Quick Start
ru: Быстрый старт

source: Here's an HTML document I'll be using as an example throughout this document. It's part of a story from *Alice in Wonderland*::
ru: Вот HTML-документ, который я буду использовать в качестве примера в этой документации. Это фрагмент из «Алисы в стране чудес»::

source: Running the "three sisters" document through Beautiful Soup gives us a :py:class:`BeautifulSoup` object, which represents the document as a nested data structure::
ru: Прогон документа через Beautiful Soup дает нам объект :py:class:`BeautifulSoup`, который представляет документ в виде вложенной структуры данных::

source: Here are some simple ways to navigate that data structure::
ru: Вот несколько простых способов навигации по этой структуре данных::

source: One common task is extracting all the URLs found within a page's <a> tags::
ru: Одна из распространенных задач — извлечь все URL-адреса, найденные на странице в тегах <a>::

source: Another common task is extracting all the text from a page::
ru: Другая распространенная задача — извлечь весь текст со страницы::

source: Does this look like what you need? If so, read on.
ru: Это похоже на то, что вам нужно? Если да, продолжайте читать.

source: Installing Beautiful Soup
ru: Установка Beautiful Soup

source: If you're using a recent version of Debian or Ubuntu Linux, you can install Beautiful Soup with the system package manager:
ru: Если вы используете последнюю версию Debian или Ubuntu Linux, вы можете установить Beautiful Soup с помощью системы управления пакетами:

source: Beautiful Soup 4 is published through PyPi, so if you can't install it with the system packager, you can install it with ``easy_install`` or ``pip``. The package name is ``beautifulsoup4``. Make sure you use the right version of ``pip`` or ``easy_install`` for your Python version (these may be named ``pip3`` and ``easy_install3`` respectively).
ru: Beautiful Soup 4 публикуется через PyPi, поэтому, если вы не можете установить библиотеку с помощью системы управления пакетами, можно установить с помощью ``easy_install`` или ``pip``. Пакет называется ``beautifulsoup4``. Убедитесь, что вы используете версию ``pip`` или ``easy_install``, предназначенную для вашей версии Python (они могут называться ``pip3`` и ``easy_install3`` соответственно).

source: (The :py:class:`BeautifulSoup` package is *not* what you want. That's the previous major release, `Beautiful Soup 3`_. Lots of software uses BS3, so it's still available, but if you're writing new code you should install ``beautifulsoup4``.)
ru: (:py:class:`BeautifulSoup` — это *не тот* пакет, который вам нужен. Это предыдущий основной релиз, `Beautiful Soup 3`_. Многие программы используют BS3, так что он все еще доступен, но если вы пишете новый код, нужно установить ``beautifulsoup4``.)

source: If you don't have ``easy_install`` or ``pip`` installed, you can `download the Beautiful Soup 4 source tarball <http://www.crummy.com/software/BeautifulSoup/download/4.x/>`_ and install it with ``setup.py``.
ru: Если у вас не установлены ``easy_install`` или ``pip``, вы можете `скачать архив с исходным кодом Beautiful Soup 4 <http://www.crummy.com/software/BeautifulSoup/download/4.x/>`_ и установить его с помощью ``setup.py``.

source: If all else fails, the license for Beautiful Soup allows you to package the entire library with your application. You can download the tarball, copy its ``bs4`` directory into your application's codebase, and use Beautiful Soup without installing it at all.
ru: Если ничего не помогает, лицензия на Beautiful Soup позволяет упаковать библиотеку целиком вместе с вашим приложением. Вы можете скачать tar-архив, скопировать из него в кодовую базу вашего приложения каталог ``bs4`` и использовать Beautiful Soup, не устанавливая его вообще.

source: I use Python 3.10 to develop Beautiful Soup, but it should work with other recent versions.
ru: Я использую Python 3.10 для разработки, но библиотека должна работать и с более поздними версиями Python.

source: Installing a parser
ru: Установка парсера

source: Beautiful Soup supports the HTML parser included in Python's standard library, but it also supports a number of third-party Python parsers. One is the `lxml parser <http://lxml.de/>`_. Depending on your setup, you might install lxml with one of these commands:
ru: Beautiful Soup поддерживает парсер HTML, включенный в стандартную библиотеку Python, а также ряд сторонних парсеров на Python. Одним из них является `парсер lxml <http://lxml.de/>`_. В зависимости от ваших настроек, вы можете установить lxml с помощью одной из следующих команд:

source: Another alternative is the pure-Python `html5lib parser <http://code.google.com/p/html5lib/>`_, which parses HTML the way a web browser does. Depending on your setup, you might install html5lib with one of these commands:
ru: Другая альтернатива — написанный исключительно на Python `парсер html5lib <http://code.google.com/p/html5lib/>`_, который разбирает HTML таким же образом, как это делает веб-браузер. В зависимости от ваших настроек, вы можете установить html5lib с помощью одной из этих команд:

source: This table summarizes the advantages and disadvantages of each parser library:
ru: Эта таблица суммирует преимущества и недостатки каждого парсера:

source: Parser
ru: Парсер

source: Typical usage
ru: Типичное использование

source: Advantages
ru: Преимущества

source: Disadvantages
ru: Недостатки

source: Python's html.parser
ru: html.parser от Python

source: Batteries included
ru: Входит в комплект

source: Decent speed
ru: Приличная скорость

source: Not as fast as lxml, less lenient than html5lib.
ru: Не такой быстрый, как lxml, более строгий, чем html5lib

source: lxml's HTML parser
ru: HTML-парсер в lxml

source: Very fast
ru: Очень быстрый

source: External C dependency
ru: Внешняя зависимость от C

source: lxml's XML parser
ru: XML-парсер в lxml

source: The only currently supported XML parser
ru: Единственный XML-парсер, который сейчас поддерживается

source: Extremely lenient
ru: Очень нестрогий

source: Parses pages the same way a web browser does
ru: Разбирает страницы так же, как это делает браузер

source: Creates valid HTML5
ru: Создает валидный HTML5

source: Very slow
ru: Очень медленный

source: External Python dependency
ru: Внешняя зависимость от Python

source: If you can, I recommend you install and use lxml for speed.
ru: Я рекомендую по возможности установить и использовать lxml для быстродействия.

source: Note that if a document is invalid, different parsers will generate different Beautiful Soup trees for it. See `Differences between parsers`_ for details.
ru: Обратите внимание, что если документ невалиден, различные парсеры будут генерировать дерево Beautiful Soup для этого документа по-разному. Ищите подробности в разделе `Различия между парсерами`_.

source: Making the soup
ru: Приготовление супа

source: To parse a document, pass it into the :py:class:`BeautifulSoup` constructor. You can pass in a string or an open filehandle::
ru: Чтобы разобрать документ, передайте его в конструктор :py:class:`BeautifulSoup`. Вы можете передать строку или открытый дескриптор файла::

source: First, the document is converted to Unicode, and HTML entities are converted to Unicode characters::
ru: Первым делом документ конвертируется в Unicode, а HTML-мнемоники конвертируются в символы Unicode::

source: Beautiful Soup then parses the document using the best available parser. It will use an HTML parser unless you specifically tell it to use an XML parser. (See `Parsing XML`_.)
ru: Затем Beautiful Soup анализирует документ, используя лучший из доступных парсеров. Библиотека будет использовать HTML-парсер, если вы явно не укажете, что нужно использовать XML-парсер. (См. `Разбор XML`_.)

source: Kinds of objects
ru: Виды объектов

source: Beautiful Soup transforms a complex HTML document into a complex tree of Python objects. But you'll only ever have to deal with about four *kinds* of objects: :py:class:`Tag`, :py:class:`NavigableString`, :py:class:`BeautifulSoup`, and :py:class:`Comment`. These objects represent the HTML *elements* that comprise the page.
ru: Beautiful Soup превращает сложный HTML-документ в сложное дерево объектов Python. Однако вам придется иметь дело только с четырьмя *видами* объектов: :py:class:`Tag`, :py:class:`NavigableString`, :py:class:`BeautifulSoup` и :py:class:`Comment`. Эти объекты представляют собой *элементы* HTML, составляющие страницу.

source: A :py:class:`Tag` object corresponds to an XML or HTML tag in the original document.
ru: Объект :py:class:`Tag` соответствует тегу XML или HTML в исходном документе::

source: Tags have a lot of attributes and methods, and I'll cover most of them in `Navigating the tree`_ and `Searching the tree`_. For now, the most important methods of a tag are for accessing its name and attributes.
ru: У объекта Tag (далее «тег») много атрибутов и методов, и я расскажу о большинстве из них в разделах `Навигация по дереву`_ и `Поиск по дереву`_. На данный момент наиболее важными методами тега являются используемые для доступа к его имеми и атрибутам.

source: Every tag has a name::
ru: У каждого тега есть имя::

source: If you change a tag's name, the change will be reflected in any markup generated by Beautiful Soup down the line::
ru: Если вы измените имя тега, это изменение будет отражено в любой HTML- разметке, созданной Beautiful Soup в дальнейшем::

source: An HTML or XML tag may have any number of attributes. The tag ``<b id="boldest">`` has an attribute "id" whose value is "boldest". You can access a tag's attributes by treating the tag like a dictionary::
ru: У тега HTML или XML может быть любое количество атрибутов. Тег ``<b id = "boldest">`` имеет атрибут "id", значение которого равно "boldest". Вы можете получить доступ к атрибутам тега, обращаясь с тегом как со словарем::

source: You can access the dictionary of attributes directly as ``.attrs``::
ru: Вы можете получить доступ к словарю атрибутов напрямую как к ``.attrs``::

source: You can add, remove, and modify a tag's attributes. Again, this is done by treating the tag as a dictionary::
ru: Вы можете добавлять, удалять и изменять атрибуты тега. Опять же, это делается путем обращения с тегом как со словарем:: tag tag

source: Multi-valued attributes
ru: Многозначные атрибуты

source: HTML 4 defines a few attributes that can have multiple values. HTML 5 removes a couple of them, but defines a few more. The most common multi-valued attribute is ``class`` (that is, a tag can have more than one CSS class). Others include ``rel``, ``rev``, ``accept-charset``, ``headers``, and ``accesskey``. By default, Beautiful Soup stores the value(s) of a multi-valued attribute as a list::
ru: В HTML 4 определено несколько атрибутов, которые могут иметь множество значений. В HTML 5 пара таких атрибутов удалена, но определено еще несколько. Самый распространенный из многозначных атрибутов — это ``class`` (т. е. тег может иметь более одного класса CSS). Среди прочих ``rel``, ``rev``, ``accept-charset``, ``headers`` и ``accesskey``. По умолчанию Beautiful Soup хранит значение(я) многозначного атрибута в виде списка::

source: When you turn a tag back into a string, the values of any multi-valued attributes are consolidated::
ru: Когда вы преобразовываете тег обратно в строку, значения многозначных атрибутов объединяются::

source: If an attribute *looks* like it has more than one value, but it's not a multi-valued attribute as defined by any version of the HTML standard, Beautiful Soup stores it as a simple string::
ru: Если атрибут *выглядит* так, будто он имеет более одного значения, но это не многозначный атрибут, определенный какой-либо версией HTML- стандарта, Beautiful Soup хранит его в виде простой строки::

source: You can force all attributes to be stored as strings by passing ``multi_valued_attributes=None`` as a keyword argument into the :py:class:`BeautifulSoup` constructor::
ru: Вы можете включить хранение значений атрибутов в виде строки, передав ``multi_valued_attributes = None`` в качестве именованного аргумента в конструктор :py:class:`BeautifulSoup`::

source: You can use ``get_attribute_list`` to always return the value in a list container, whether it's a string or multi-valued attribute value::
ru: Вы можете использовать ``get_attribute_list``, чтобы получить значение в контейнере списка, независимо от того, является ли атрибут многозначным или нет::

source: If you parse a document as XML, there are no multi-valued attributes::
ru: Если вы разбираете документ как XML, многозначных атрибутов не будет::

source: Again, you can configure this using the ``multi_valued_attributes`` argument::
ru: Опять же, вы можете поменять настройку, используя аргумент ``multi_valued_attributes``::

source: You probably won't need to do this, but if you do, use the defaults as a guide. They implement the rules described in the HTML specification::
ru: Вряд ли вам это пригодится, но если все-таки будет нужно, руководствуйтесь значениями по умолчанию. Они реализуют правила, описанные в спецификации HTML::

source: A tag can contain strings as pieces of text. Beautiful Soup uses the :py:class:`NavigableString` class to contain these pieces of text::
ru: Тег может содержать строки как фрагменты текста. Beautiful Soup использует класс :py:class:`NavigableString` для хранения этих фрагментов текста::

source: A :py:class:`NavigableString` is just like a Python Unicode string, except that it also supports some of the features described in `Navigating the tree`_ and `Searching the tree`_. You can convert a :py:class:`NavigableString` to a Unicode string with ``str``::
ru: :py:class:`NavigableString` похожа на строку Unicode в Python, не считая того, что она также поддерживает некоторые функции, описанные в разделах `Навигация по дереву`_ и `Поиск по дереву`_. Вы можете конвертировать :py:class:`NavigableString` в строку Unicode с помощью ``str``::

source: You can't edit a string in place, but you can replace one string with another, using :ref:`replace_with()`::
ru: Вы не можете редактировать строку непосредственно, но вы можете заменить одну строку другой, используя :ref:`replace_with()`::

source: :py:class:`NavigableString` supports most of the features described in `Navigating the tree`_ and `Searching the tree`_, but not all of them. In particular, since a string can't contain anything (the way a tag may contain a string or another tag), strings don't support the ``.contents`` or ``.string`` attributes, or the ``find()`` method.
ru: :py:class:`NavigableString` поддерживает большинство функций, описанных в разделах `Навигация по дереву`_ и `Поиск по дереву`_, но не все. В частности, поскольку строка не может ничего содержать (в том смысле, в котором тег может содержать строку или другой тег), строки не поддерживают атрибуты ``.contents`` и ``.string`` или метод ``find()``.

source: If you want to use a :py:class:`NavigableString` outside of Beautiful Soup, you should call ``unicode()`` on it to turn it into a normal Python Unicode string. If you don't, your string will carry around a reference to the entire Beautiful Soup parse tree, even when you're done using Beautiful Soup. This is a big waste of memory.
ru: Если вы хотите использовать :py:class:`NavigableString` вне Beautiful Soup, вам нужно вызвать метод ``unicode()``, чтобы превратить ее в обычную для Python строку Unicode. Если вы этого не сделаете, ваша строка будет тащить за собой ссылку на все дерево разбора Beautiful Soup, даже когда вы закончите использовать Beautiful Soup. Это большой расход памяти.

source: The :py:class:`BeautifulSoup` object represents the parsed document as a whole. For most purposes, you can treat it as a :py:class:`Tag` object. This means it supports most of the methods described in `Navigating the tree`_ and `Searching the tree`_.
ru: Объект :py:class:`BeautifulSoup` представляет разобранный документ как единое целое. В большинстве случаев вы можете рассматривать его как объект :py:class:`Tag`. Это означает, что он поддерживает большинство методов, описанных в разделах `Навигация по дереву`_ и `Поиск по дереву`_.

source: You can also pass a :py:class:`BeautifulSoup` object into one of the methods defined in `Modifying the tree`_, just as you would a :py:class:`Tag`. This lets you do things like combine two parsed documents::
ru: Вы также можете передать объект :py:class:`BeautifulSoup` в один из методов, перечисленных в разделе `Изменение дерева`_, по аналогии с :py:class:`Tag`. Это позволяет вам делать такие вещи, как объединение двух разобранных документов::

source: Since the :py:class:`BeautifulSoup` object doesn't correspond to an actual HTML or XML tag, it has no name and no attributes. But sometimes it's useful to reference its ``.name`` (such as when writing code that works with both :py:class:`Tag` and :py:class:`BeautifulSoup` objects), so it's been given the special ``.name`` "[document]"::
ru: Поскольку объект :py:class:`BeautifulSoup` не соответствует действительному HTML- или XML-тегу, у него нет имени и атрибутов. Однако иногда полезно ссылаться на ``.name`` объекта (например, при написании кода, который работает как с объектами :py:class:`Tag`, так и :py:class:`BeautifulSoup`), поэтому ему было присвоено специальное имя ``.name`` "[document]"::

source: Special strings
ru: Специальные строки

source: :py:class:`Tag`, :py:class:`NavigableString`, and :py:class:`BeautifulSoup` cover almost everything you'll see in an HTML or XML file, but there are a few leftover bits. The main one you'll probably encounter is the :py:class:`Comment`.
ru: :py:class:`Tag`, :py:class:`NavigableString` и :py:class:`BeautifulSoup` охватывают почти все, с чем вы столкнетесь в файле HTML или XML, но осталось еще немного. Пожалуй, единственное, с чем вам придется столкнуться, это :py:class:`Comment`::

source: The :py:class:`Comment` object is just a special type of :py:class:`NavigableString`::
ru: Объект :py:class:`Comment` — это просто особый тип :py:class:`NavigableString`::

source: But when it appears as part of an HTML document, a :py:class:`Comment` is displayed with special formatting::
ru: Но когда он появляется как часть HTML-документа, :py:class:`Comment` отображается со специальным форматированием::

source: For HTML documents
ru: Для документов HTML

source: Beautiful Soup defines a few :py:class:`NavigableString` subclasses to contain strings found inside specific HTML tags. This makes it easier to pick out the main body of the page, by ignoring strings that probably represent programming directives found within the page. *(These classes are new in Beautiful Soup 4.9.0, and the html5lib parser doesn't use them.)*
ru: Beautiful Soup определяет несколько подклассов :py:class:`NavigableString`, которые содержат строки, найденные внутри определенных HTML-тегов. Это облегчает выделение основной части страницы путем игнорирования строк, которые, вероятно, представляют собой программные директивы, найденные на странице. *(Эти классы являются новыми в Beautiful Soup 4.9.0, и парсер html5lib их не использует.)*

source: A :py:class:`NavigableString` subclass that represents embedded CSS stylesheets; that is, any strings found inside a ``<style>`` tag during document parsing.
ru: Подкласс :py:class:`NavigableString`, который представляет встроенные таблицы стилей CSS, то есть любые строки, найденные при разборе документа внутри тега ``<style>``.
