Repository: authoress/bs4ru
Catalog: doc_bs4_4.13.3/locale/*/LC_MESSAGES/bs4ru.po
Languages: ru

source: The function can be as complicated as you need it to be. Here's a function that returns ``True`` if a tag is surrounded by string objects::
ru: Функция может быть настолько сложной, насколько вам нужно. Вот функция, которая возвращает ``True``, если тег окружен строковыми объектами::

source: A list
ru: Список

source: If you pass in a list, Beautiful Soup will look for a match against *any* string, regular expression, or function in that list. This code finds all the <a> tags *and* all the <b> tags::
ru: Если вы передадите список, Beautiful Soup будет искать совпадение строк с *любой* строкой, регулярным выражением или функцией из этого списка. Следующий код находит все теги <a> *и* все теги <b>::

source: Now we're ready to look at the search methods in detail.
ru: Теперь мы готовы подробно рассмотреть методы поиска.

source: Method signature: find_all(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`recursive <recursive>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_all(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`recursive <recursive>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)

source: The ``find_all()`` method looks through a tag's descendants and retrieves *all* descendants that match your filters. I gave several examples in `Kinds of filters`_, but here are a few more::
ru: Метод ``find_all()`` просматривает потомков тега и извлекает *всех* потомков, которые соответствую вашим фильтрам. Я привел несколько примеров в разделе `Виды фильтров`_, а вот еще несколько::

source: Some of these should look familiar, but others are new. What does it mean to pass in a value for ``string``, or ``id``? Why does ``find_all("p", "title")`` find a <p> tag with the CSS class "title"? Let's look at the arguments to ``find_all()``.
ru: Кое-что из этого нам уже знакомо, но есть и новое. Что означает передача значения для ``string`` или ``id``? Почему ``find_all ("p", "title")`` находит тег <p> с CSS-классом "title"? Давайте посмотрим на аргументы ``find_all()``.

source: The ``name`` argument
ru: Аргумент ``name``

source: Pass in a value for ``name`` and you'll tell Beautiful Soup to only consider tags with certain names. Text strings will be ignored, as will tags whose names that don't match.
ru: Передайте значение для аргумента ``name``, и вы скажете Beautiful Soup рассматривать только теги с определенными именами. Текстовые строки будут игнорироваться, так же как и теги, имена которых не соответствуют заданным.

source: This is the simplest usage::
ru: Вот простейший пример использования::

source: Recall from `Kinds of filters`_ that the value to ``name`` can be `a string`_, `a regular expression`_, `a list`_, `a function`_, or `the value True`_.
ru: В разделе `Виды фильтров`_ говорилось, что значением ``name`` может быть `строка`_, `регулярное выражение`_, `список`_, `функция`_ или `True`_.

source: The keyword arguments
ru: Именованные аргументы

source: Any keyword argument that's not recognized will be turned into a filter that matches tags by their attributes.
ru: Любой нераспознанный именованный аргумент будет преобразован в фильтр, который сопоставляет теги по их атрибутам.

source: If you pass in a value for an argument called ``id``, Beautiful Soup will filter against each tag's 'id' attribute value::
ru: Если вы передадите значение для аргумента ``id``, Beautiful Soup отфильтрует по атрибуту "id" каждого тега::

source: Just as with tags, you can filter an attribute based on `a string`_, `a regular expression`_, `a list`_, `a function`_, or `the value True`_.
ru: Как и в случае с тегами, для фильтрации по атрибуту может использоваться `строка`_, `регулярное выражение`_, `список`_, `функция`_ или значение `True`_.

source: If you pass in a regular expression object for ``href``, Beautiful Soup will pattern-match against each tag's 'href' attribute value::
ru: Если вы передадите значение для ``href``, Beautiful Soup будет сопоставлять шаблон с атрибутом "href" каждого тега::

source: The value ``True`` matches every tag that defines the attribute. This code finds *all* tags with an ``id`` attribute::
ru: Значение ``True`` соответствует любому тегу с определенным атрибутом. Следующий код находит в документе *все* теги с атрибутом ``id``::

source: For more complex matches, you can define a function that takes an attribute value as its only argument. The function should return ``True`` if the value matches, and ``False`` otherwise.
ru: Для более сложных случаев вы можете определить функцию, которая принимает значение атрибута в качестве единственного аргумента. Функция должна вернуть ``True``, если значение подходит, и ``False``, если нет.

source: Here's a function that finds all ``a`` tags whose ``href`` attribute *does not* match a regular expression::
ru: Вот функция, которая находит все теги ``a``, чей атрибут ``href`` *не* соответствует регулярному выражению::

source: If you pass in a list for an argument, Beautiful Soup will look for an attribute-value match against *any* string, regular expression, or function in that list. This code finds the first and last link::
ru: Если вы передадите список, Beautiful Soup будет искать совпадение строк с *любой* строкой, регулярным выражением или функцией из этого списка. Следующий код находит все теги <a> `и` все теги <b>::

source: You can filter against multiple attributes at once by passing multiple keyword arguments::
ru: Вы можете отфильтровать по нескольким атрибутам одновременно, передав более одного именованного аргумента::

source: Some attributes, like the data-* attributes in HTML 5, have names that can't be used as the names of keyword arguments::
ru: Некоторые атрибуты, такие как атрибуты data-* в HTML 5, имеют имена, которые нельзя использовать в качестве имен именованных аргументов::

source: You can use these attributes in searches by putting them into a dictionary and passing the dictionary into ``find_all()`` as the ``attrs`` argument::
ru: Вы можете использовать эти атрибуты в поиске, поместив их в словарь и передав словарь в ``find_all()`` как аргумент ``attrs``::

source: Similarly, you can't use a keyword argument to search for HTML's 'name' attribute, because Beautiful Soup uses the ``name`` argument to contain the name of the tag itself. Instead, you can give a value to 'name' in the ``attrs`` argument::
ru: Сходным образом, нельзя использовать именованный аргумент для поиска в HTML по элементу "name", потому что Beautiful Soup использует аргумент ``name`` для имени самого тега. Вместо этого вы можете передать элемент "name" вместе с его значением в составе аргумента ``attrs``::

source: Searching by CSS class
ru: Поиск по классу CSS

source: It's very useful to search for a tag that has a certain CSS class, but the name of the CSS attribute, "class", is a reserved word in Python. Using ``class`` as a keyword argument will give you a syntax error. As of Beautiful Soup 4.1.2, you can search by CSS class using the keyword argument ``class_``::
ru: Очень удобно искать тег с определенным классом CSS, но имя атрибута CSS, "class", является зарезервированным словом в Python. Использование ``class`` в качестве именованного аргумента приведет к синтаксической ошибке. Начиная с Beautiful Soup 4.1.2, вы можете выполнять поиск по классу CSS, используя именованный аргумент ``class_``::

source: As with any keyword argument, you can pass ``class_`` a string, a regular expression, a function, or ``True``::
ru: Как и с любым именованным аргументом, вы можете передать в качестве значения ``class_`` строку, регулярное выражение, функцию или ``True``::

source: :ref:`Remember <multivalue>` that a single tag can have multiple values for its "class" attribute. When you search for a tag that matches a certain CSS class, you're matching against *any* of its CSS classes::
ru: Помните, что один тег может иметь :ref:`несколько значений <multivalue>` для атрибута "class". Когда вы ищете тег, который соответствует определенному классу CSS, вы ищете соответствие *любому* из его классов CSS::

source: You can also search for the exact string value of the ``class`` attribute::
ru: Можно искать точное строковое значение атрибута ``class``::

source: But searching for variants of the string value won't work::
ru: Но поиск вариантов строкового значения не сработает::

source: In older versions of Beautiful Soup, which don't have the ``class_`` shortcut, you can use the ``attrs`` argument trick mentioned above. Create a dictionary whose value for "class" is the string (or regular expression, or whatever) you want to search for::
ru: В старых версиях Beautiful Soup, в которых нет ярлыка ``class_`` можно использовать трюк с аргументом ``attrs``, упомянутый выше. Создайте словарь, значение которого для "class" является строкой (или регулярным выражением, или чем угодно еще), которую вы хотите найти::

source: To search for tags that match two or more CSS classes at once, use the :py:meth:`Tag.select` CSS selector method :ref:`described here <css-selectors>`::
ru: Для поиска тегов, которые соответствуют двум или более классам CSS, используйте метод селекторов CSS :py:meth:`Tag.select`, :ref:`описанный тут <css-selectors>`::

source: The ``string`` argument
ru: Аргумент ``string``

source: With the ``string`` argument, you can search for strings instead of tags. As with ``name`` and attribute keyword arguments, you can pass in `a string`_, `a regular expression`_, `a function`_, `a list`_, or `the value True`_. Here are some examples::
ru: С помощью аргумента ``string`` вы можете искать строки вместо тегов. Как и в случае с ``name`` и именованными аргументами атрибута, передаваться может `строка`_, `регулярное выражение`_, `список`_, `функция`_ или значения `True`_. Вот несколько примеров::

source: If you use the ``string`` argument in a tag search, Beautiful Soup will find all tags whose ``.string`` matches your value for ``string``. This code finds the <a> tags whose ``.string`` is "Elsie"::
ru: Если вы используете аргумент ``string`` в поиске по тегу, Beautiful Soup найдет все теги, в которых ``.string`` соответствует вашему значению для ``string``. Следующий код находит все теги <a>, у которых ``.string`` равно "Elsie"::

source: The ``string`` argument is new in Beautiful Soup 4.4.0. In earlier versions it was called ``text``::
ru: Аргумент ``string`` — это новое в Beautiful Soup 4.4.0. В ранних версиях он назывался ``text``::

source: The ``limit`` argument
ru: Аргумент ``limit``

source: ``find_all()`` returns all the tags and strings that match your filters. This can take a while if the document is large. If you don't need *all* the results, you can pass in a number for ``limit``. This works just like the LIMIT keyword in SQL. It tells Beautiful Soup to stop gathering results after it's found a certain number.
ru: ``find_all()`` возвращает все теги и строки, которые соответствуют вашим фильтрам. Это может занять некоторое время, если документ большой. Если вам не нужны *все* результаты, вы можете указать их предельное число — ``limit``. Это работает так же, как ключевое слово LIMIT в SQL. Оно говорит Beautiful Soup прекратить собирать результаты после того, как их найдено определенное количество.

source: There are three links in the "three sisters" document, but this code only finds the first two::
ru: В фрагменте из «Алисы в стране чудес» есть три ссылки, но следующий код находит только первые две::

source: The ``recursive`` argument
ru: Аргумент ``recursive``

source: By default, ``mytag.find_all()`` will examine all the descendants of ``mytag``: its children, its children's children, and so on. To consider only direct children, you can pass in ``recursive=False``. See the difference here::
ru: По умолчанию ``mytag.find_all()`` проверяет всех потомков ``mytag``: его дочерние элементы, дочерние элементы дочерних элементов, и так далее. Чтобы рассматривались только непосредственные потомки (дочерние элементы), вы можете передать ``recursive = False``. Оцените разницу::

source: Here's that part of the document::
ru: Вот эта часть документа::

source: The <title> tag is beneath the <html> tag, but it's not *directly* beneath the <html> tag: the <head> tag is in the way. Beautiful Soup finds the <title> tag when it's allowed to look at all descendants of the <html> tag, but when ``recursive=False`` restricts it to the <html> tag's immediate children, it finds nothing.
ru: Тег <title> находится под тегом <html>, но не *непосредственно* под тегом <html>: на пути встречается тег <head>. Beautiful Soup находит тег <title>, когда разрешено просматривать всех потомков тега <html>, но когда ``recursive=False`` ограничивает поиск только непосредстввенно дочерними элементами, Beautiful Soup ничего не находит.

source: Beautiful Soup offers a lot of tree-searching methods (covered below), and they mostly take the same arguments as ``find_all()``: ``name``, ``attrs``, ``string``, ``limit``, and attribute keyword arguments. But the ``recursive`` argument is specific to the ``find_all()`` and ``find()`` methods. Passing ``recursive=False`` into a method like ``find_parents()`` wouldn't be very useful.
ru: Beautiful Soup предлагает множество методов поиска по дереву (они рассмотрены ниже), и они в основном принимают те же аргументы, что и ``find_all()``: ``name``, ``attrs``, ``string``, ``limit`` и именованные аргументы атрибута. Но аргумент ``recursive`` специфичен для методов ``find_all()`` и ``find()``. От передачи ``recursive=False`` в метод типа ``find_parents()`` будет не очень много пользы.

source: Calling a tag is like calling ``find_all()``
ru: Вызов тега похож на вызов ``find_all()``

source: For convenience, calling a :py:class:`BeautifulSoup` object or :py:class:`Tag` object as a function is equivalent to calling ``find_all()`` (if no built-in method has the name of the tag you're looking for). These two lines of code are equivalent::
ru: Для удобства вызов объекта :py:class:`BeautifulSoup` или объекта :py:class:`Tag` как функции эквивалентен вызову ``find_all()`` (если ни один встроенный метод не назван так же, как тег, который вы ищете). Эти две строки кода эквивалентны::

source: These two lines are also equivalent::
ru: Эти две строки также эквивалентны::

source: Method signature: find(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`recursive <recursive>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`recursive <recursive>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)

source: The ``find_all()`` method scans the entire document looking for results, but sometimes you only want to find one result. If you know a document has only one <body> tag, it's a waste of time to scan the entire document looking for more. Rather than passing in ``limit=1`` every time you call ``find_all``, you can use the ``find()`` method. These two lines of code are *nearly* equivalent::
ru: Метод ``find_all()`` сканирует весь документ в поиске всех результатов, но иногда вам нужен только один. Если вы знаете, что в документе есть только один тег <body>, нет смысла сканировать весь документ в поиске остальных. Вместо того, чтобы передавать ``limit=1`` каждый раз, когда вы вызываете ``find_all()``, используйте метод ``find()``. Эти две строки кода эквивалентны::

source: The only difference is that ``find_all()`` returns a list containing the single result, and ``find()`` just returns the result.
ru: Разница лишь в том, что ``find_all()`` возвращает список, содержащий единственный результат, а ``find()`` возвращает только сам результат.

source: If ``find_all()`` can't find anything, it returns an empty list. If ``find()`` can't find anything, it returns ``None``::
ru: Если ``find_all()`` не может ничего найти, он возвращает пустой список. Если ``find()`` не может ничего найти, он возвращает ``None``::

source: Remember the ``soup.head.title`` trick from `Navigating using tag names`_? That trick works by repeatedly calling ``find()``::
ru: Помните трюк с ``soup.head.title`` из раздела `Навигация с использованием имен тегов`_? Этот трюк работает на основе неоднократного вызова ``find()``::

source: ``find_parents()`` and ``find_parent()``
ru: ``find_parents()`` и ``find_parent()``

source: Method signature: find_parents(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_parents(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)

source: Method signature: find_parent(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_parent(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)

source: I spent a lot of time above covering ``find_all()`` and ``find()``. The Beautiful Soup API defines ten other methods for searching the tree, but don't be afraid. Five of these methods are basically the same as ``find_all()``, and the other five are basically the same as ``find()``. The only differences are in how they move from one part of the tree to another.
ru: Я долго объяснял, как работают ``find_all()`` и ``find()``. Beautiful Soup API определяет десяток других методов для поиска по дереву, но пусть вас это не пугает. Пять из этих методов в целом похожи на ``find_all()``, а другие пять в целом похожи на ``find()``. Единственное различие состоит в том, как они перемещаются от одной части дерева к другой.

source: First let's consider ``find_parents()`` and ``find_parent()``. Remember that ``find_all()`` and ``find()`` work their way down the tree, looking at tag's descendants. These methods do the opposite: they work their way *up* the tree, looking at a tag's (or a string's) parents. Let's try them out, starting from a string buried deep in the "three daughters" document::
ru: Сначала давайте рассмотрим ``find_parents()`` и ``find_parent()``. Помните, что ``find_all()`` и ``find()`` прорабатывают дерево сверху вниз, просматривая теги и их потомков. ``find_parents()`` и ``find_parent()`` делают наоборот: они идут *снизу вверх*, рассматривая родительские элементы тега или строки. Давайте испытаем их, начав со строки, закопанной глубоко в фрагменте из «Алисы в стране чудес»::

source: One of the three <a> tags is the direct parent of the string in question, so our search finds it. One of the three <p> tags is an indirect parent (*ancestor*) of the string, and our search finds that as well. There's a <p> tag with the CSS class "title" *somewhere* in the document, but it's not one of this string's parents, so we can't find it with ``find_parents()``.
ru: Один из трех тегов <a> является прямым родителем искомой строки, так что наш поиск находит его. Один из трех тегов <p> является непрямым родителем (*ancestor*) строки, и наш поиск тоже его находит. Где-то в документе есть тег <p> с классом CSS "title", но он не является родительским для строки, так что мы не можем найти его с помощью ``find_parents()``.

source: You may have noticed a similarity between ``find_parent()`` and ``find_parents()``, and the `.parent`_ and `.parents`_ attributes mentioned earlier. These search methods actually use the ``.parents`` attribute to iterate through all parents (unfiltered), checking each one against the provided filter to see if it matches.
ru: Вы могли заметить связь между ``find_parent()``, ``find_parents()`` и атрибутами `.parent`_ и `.parents`_, упомянутыми ранее. Эти методы поиска на самом деле используют атрибут ``.parents``, чтобы перебрать все родительские элементы (без фильтрации), проверяя каждый из них на соответствие заданному фильтру.

source: ``find_next_siblings()`` and ``find_next_sibling()``
ru: ``find_next_siblings()`` и ``find_next_sibling()``

source: Method signature: find_next_siblings(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_next_siblings(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)

source: Method signature: find_next_sibling(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_next_sibling(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)

source: These methods use :ref:`.next_siblings <sibling-generators>` to iterate over the rest of an element's siblings in the tree. The ``find_next_siblings()`` method returns all the siblings that match, and ``find_next_sibling()`` returns only the first one::
ru: Эти методы используют :ref:`.next_siblings <sibling-generators>` для перебора одноуровневых элементов для данного элемента в дереве. Метод ``find_next_siblings()`` возвращает все подходящие одноуровневые элементы, а ``find_next_sibling()`` возвращает только первый из них::

source: ``find_previous_siblings()`` and ``find_previous_sibling()``
ru: ``find_previous_siblings()`` и ``find_previous_sibling()``

source: Method signature: find_previous_siblings(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_previous_siblings(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)

source: Method signature: find_previous_sibling(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_previous_sibling(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)

source: These methods use :ref:`.previous_siblings <sibling-generators>` to iterate over an element's siblings that precede it in the tree. The ``find_previous_siblings()`` method returns all the siblings that match, and ``find_previous_sibling()`` returns only the first one::
ru: Эти методы используют :ref:`.previous_siblings <sibling-generators>` для перебора тех одноуровневых элементов, которые предшествуют данному элементу в дереве разбора. Метод ``find_previous_siblings()`` возвращает все подходящие одноуровневые элементы,, а а ``find_next_sibling()`` только первый из них::

source: ``find_all_next()`` and ``find_next()``
ru: ``find_all_next()`` и ``find_next()``

source: Method signature: find_all_next(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_all_next(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)

source: Method signature: find_next(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_next(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)

source: These methods use :ref:`.next_elements <element-generators>` to iterate over whatever tags and strings that come after it in the document. The ``find_all_next()`` method returns all matches, and ``find_next()`` returns only the first match::
ru: Эти методы используют :ref:`.next_elements <element-generators>` для перебора любых тегов и строк, которые встречаются в документе после элемента. Метод ``find_all_next()`` возвращает все совпадения, а ``find_next()`` только первое::
