Repository: authoress/bs4ru
Catalog: doc_bs4_4.13.3/locale/*/LC_MESSAGES/bs4ru.po
Languages: ru

source: Decoding the document as UTF-8 raises a ``UnicodeDecodeError``, and decoding it as Windows-1252 gives you gibberish. Fortunately, ``UnicodeDammit.detwingle()`` will convert the string to pure UTF-8, allowing you to decode it to Unicode and display the snowmen and quote marks simultaneously::
ru: Декодирование документа как UTF-8 вызывает ``UnicodeDecodeError``, а декодирование его как Windows-1252 выдаст тарабарщину. К счастью, ``UnicodeDammit.detwingle()`` преобразует строку в чистый UTF-8, позволяя затем декодировать его в Unicode и отображать снеговиков и кавычки одновременно::

source: ``UnicodeDammit.detwingle()`` only knows how to handle Windows-1252 embedded in UTF-8 (or vice versa, I suppose), but this is the most common case.
ru: ``UnicodeDammit.detwingle()`` знает только, как обрабатывать Windows-1252, встроенный в UTF-8 (и наоборот, мне кажется), но это наиболее общий случай.

source: Note that you must know to call ``UnicodeDammit.detwingle()`` on your data before passing it into :py:class:`BeautifulSoup` or the ``UnicodeDammit`` constructor. Beautiful Soup assumes that a document has a single encoding, whatever it might be. If you pass it a document that contains both UTF-8 and Windows-1252, it's likely to think the whole document is Windows-1252, and the document will come out looking like ``â˜ƒâ˜ƒâ˜ƒ“I like snowmen!”``.
ru: Обратите внимание, что нужно вызывать ``UnicodeDammit.detwingle()`` для ваших данных перед передачей в конструктор :py:class:`BeautifulSoup` или ``UnicodeDammit``. Beautiful Soup предполагает, что документ имеет единую кодировку, какой бы она ни была. Если вы передадите ему документ, который содержит как UTF-8, так и Windows-1252, скорее всего, он решит, что весь документ кодируется в Windows-1252, и это будет выглядеть как ``â˜ƒâ˜ƒâ˜ƒ“I like snowmen!”``.

source: ``UnicodeDammit.detwingle()`` is new in Beautiful Soup 4.1.0.
ru: ``UnicodeDammit.detwingle()`` — это новое в Beautiful Soup 4.1.0.

source: Line numbers
ru: Нумерация строк

source: The ``html.parser`` and ``html5lib`` parsers can keep track of where in the original document each :py:class:`Tag` was found. You can access this information as ``Tag.sourceline`` (line number) and ``Tag.sourcepos`` (position of the start tag within a line)::
ru: Парсеры ``html.parser`` и ``html5lib`` могут отслеживать, где в исходном документе был найден каждый :py:class:`Tag`. Вы можете получить доступ к этой информации через ``Tag.sourceline`` (номер строки) и ``Tag.sourcepos`` (позиция начального тега в строке)::

source: Note that the two parsers mean slightly different things by ``sourceline`` and ``sourcepos``. For html.parser, these numbers represent the position of the initial less-than sign. For html5lib, these numbers represent the position of the final greater-than sign::
ru: Обратите внимание, что два парсера понимают ``sourceline`` и ``sourcepos`` немного по-разному. Для html.parser эти числа представляет позицию начального знака "<". Для html5lib эти числа представляют позицию конечного знака ">"::

source: You can shut off this feature by passing ``store_line_numbers=False`` into the :py:class:`BeautifulSoup` constructor::
ru: Вы можете отключить эту функцию, передав ``store_line_numbers = False`` в конструктор :py:class:`BeautifulSoup`::

source: *This feature is new in 4.8.1, and the parsers based on lxml don't support it.*
ru: *Эта функция является новой в 4.8.1, и парсеры, основанные на lxml, не поддерживают ее.*

source: Comparing objects for equality
ru: Проверка объектов на равенство

source: Beautiful Soup says that two :py:class:`NavigableString` or :py:class:`Tag` objects are equal when they represent the same HTML or XML markup, even if their attributes are in a different order or they live in different parts of the object tree. In this example, the two <b> tags are treated as equal, because they both look like "<b>pizza</b>"::
ru: Beautiful Soup считает, что два объекта :py:class:`NavigableString` или :py:class:`Tag` равны, если они представлены в одинаковой разметке HTML или XML, даже если их атрибуты расположены в другом порядке или они сами находятся в разных частях дерева объекта. В этом примере два тега <b> рассматриваются как равные, потому что они оба выглядят как ``<b>pizza</b>``::

source: If you want to see whether two variables refer to exactly the same object, use *is*::
ru: Если вы хотите выяснить, указывают ли две переменные на один и тот же объект, используйте *is*::

source: Copying Beautiful Soup objects
ru: Копирование объектов Beautiful Soup

source: You can use ``copy.copy()`` to create a copy of any :py:class:`Tag` or :py:class:`NavigableString`::
ru: Вы можете использовать ``copy.copy()`` для создания копии любого :py:class:`Tag` или :py:class:`NavigableString`::

source: The copy is considered equal to the original, since it represents the same markup as the original, but it's not the same object::
ru: Копия считается равной оригиналу, так как у нее такая же разметка, что и у оригинала, но это другой объект::

source: The only real difference is that the copy is completely detached from the original Beautiful Soup object tree, just as if ``extract()`` had been called on it. This is because two different :py:class:`Tag` objects can't occupy the same space at the same time.
ru: Разница в том, что копия полностью отделена от исходного дерева объекта Beautiful Soup, как если бы в отношении нее вызвали метод ``extract()``. Это связано с тем, что два разных объекта :py:class:`Tag` не могут одновременно занимать одно и то же пространство.

source: You can use :py:meth:`Tag.copy_self` to create a copy of a :py:class:`Tag` without copying its contents.
ru: Вы можете использовать :py:meth:`Tag.copy_self`, чтобы создать копию :py:class:`Tag`, не копируя его содержимое.

source: *(Tag.copy_self() is introduced in Beautiful Soup 4.13.0.)*
ru: *(Tag.copy_self() введен в Beautiful Soup 4.13.0.)*

source: Low-level search interface
ru: Низкоуровневый интерфейс поиска

source: Almost everyone who uses Beautiful Soup to extract information from a document can get what they need using the methods described in `Searching the tree`_. However, there's a lower-level interface that lets you define any matching behavior you want. Behind the scenes, the parts of the Beautiful Soup API that most people use--``find_all()`` and the like—are actually using this low-level interface, and you can use it directly.
ru: Почти все, кто использует Beautiful Soup для извлечения информации из документа, могут получить всё необходимое, используя методы, описанные в разделе `Поиск по дереву`_. Однако есть низкоуровневый интерфейс, который позволяет вам задать любое желаемое поведение для сопоставляемых элементов. Те части API Beautiful Soup, которые использует большинство людей — ``find_all()`` и другие — на самом деле под капотом используют этот низкоуровневый интерфейс. Вы можете использовать его напрямую.

source: *(Access to the low-level search interface is a new feature in Beautiful Soup 4.13.0.)*
ru: *(Доступ к низкоуровневому интерфейсу поиска — это новая возможность в Beautiful Soup 4.13.0.)*

source: Custom element filtering
ru: Настраиваемая фильтрация элементов

source: The :py:class:`ElementFilter` class is your entry point to the low-level interface. To use it, define a function that takes a :py:class:`PageElement` object (which could be either a :py:class:`Tag` or a :py:class:`NavigableString`). The function must return ``True`` if the element matches your custom criteria, and ``False`` if it doesn't.
ru: Ваша точка входа в низкоуровневый интерфейс -- это класс :py:class:`ElementFilter`. Чтобы использовать его, определите функцию, которая принимает объект :py:class:`PageElement`. Этот объект может быть либо :py:class:`Tag`, либо :py:class:`NavigableString`. Функция должна возвращать ``True``, если элемент соответствует вашим пользовательским критериям, и ``False``, если нет.

source: This example function looks for content-containing tags and strings, but skips whitespace-only strings::
ru: Функция в примере ниже ищет теги и строки, в которых есть содержимое, и пропускает строки, состоящие только из пробелов::

source: Once you have a function, pass it into the :py:class:`ElementFilter` constructor::
ru: Когда ваша функция готова, передайте ее в конструктор :py:class:`ElementFilter`::

source: You can then use this :py:class:`ElementFilter` object as the first argument to any of the `Searching the tree`_ methods. Whatever criteria you defined in your function will be used instead of the default Beautiful Soup match logic::
ru: Затем вы можете использовать этот объект :py:class:`ElementFilter` в качестве первого аргумента для любого из методов, описанных в разделе `Поиск по дереву`_. Критерий, который вы определили в своей функции, будет использоваться вместо той логики сопоставления, которая действует в Beautiful Soup по умолчанию::

source: Every potential match will be run through your function, and the only :py:class:`PageElement` objects returned will be the ones where your function returned ``True``.
ru: Каждое потенциальное совпадение будет пропущено через вашу функцию, а возвращаться будут те объекты :py:class:`PageElement`, для которых ваша функция вернула ``True``.

source: To summarize the function-based matching behaviors,
ru: Подведем итог.

source: A function passed as the first argument to a search method (or equivalently, using the ``name`` argument) considers only :py:class:`Tag` objects.
ru: Функция, переданная в качестве первого аргумента методу поиска (или, что эквивалентно, с использованием аргумента ``name``), учитывает только объекты :py:class:`Tag`.

source: A function passed to a search method using the ``string`` argument considers only :py:class:`NavigableString` objects.
ru: Функция, переданная методу поиска с использованием аргумента ``string``, учитывает только объекты :py:class:`NavigableString`.

source: A function passed to a search method using an :py:class:`ElementFilter` object considers both :py:class:`Tag` and :py:class:`NavigableString` objects.
ru: Функция, переданная методу поиска с использованием объекта :py:class:`ElementFilter`, учитывает как объекты :py:class:`Tag`, так и :py:class:`NavigableString`.

source: Custom element iteration
ru: Настраиваемый перебор элементов

source: By passing an :py:class:`ElementFilter` instance into Beautiful Soup's tree-searching methods, you can completely customize what it means for Beautiful Soup to match an element as it iterates over the parse tree. By using the :py:meth:`ElementFilter.filter()` method, you can also completely customize what it means for Beautiful Soup to iterate over the parse tree in the first place.
ru: Передавая экземпляр :py:class:`ElementFilter` в методы поиска по дереву Beautiful Soup, вы можете полностью настроить, как Beautiful Soup должен сопоставлять элементы при проходе по дереву разбора. Используя метод :py:meth:`ElementFilter.filter()`, вы также можете полностью настроить, как именно Beautiful Soup должен проходить по дереву разбора.

source: The :py:meth:`ElementFilter.filter()` method takes a generator that yields a stream of :py:class:`PageElement` objects. There is no restriction on which :py:class:`PageElement` objects show up, how many times they show up, or in which order. Theoretically, they don't even need to be from the same :py:class:`BeautifulSoup` document. You can do whatever makes sense for you.
ru: Метод :py:meth:`ElementFilter.filter()` принимает генератор, который выдает поток объектов :py:class:`PageElement`. Нет никаких ограничений на то, какие объекты :py:class:`PageElement` будут отображаться, сколько раз они будут отображаться или в каком порядке. Теоретически, они даже не обязательно должны быть из одного и того же документа :py:class:`BeautifulSoup`. Вы можете делать все, что сочтете нужным.

source: Here's a silly example: a generator that walks randomly back and forth through the parse tree::
ru: Вот дурацкий пример: генератор, который в случайном порядке ходит туда-сюда по дереву разбора::

source: Pass this generator into the example :py:meth:`ElementFilter.filter()` and Beautiful Soup will wander randomly around the parse tree, applying the ``non_whitespace_filter`` function to every element it finds, and yielding all of the matches—potentially yielding a given object more than once::
ru: Передайте этот генератор в :py:meth:`ElementFilter.filter()`, и Beautiful Soup будет в случайном порядке проходить по дереву разбора, применяя функцию ``non_whitespace_filter`` к каждому найденному элементу и выдавая все совпадения, в том числе потенциально выдавая заданный объект более одного раза::

source: (Note that unlike the other code examples in this documentation, this example can give different results every time you run it, thanks to the random element. It's very unlikely, but this function could wander around the parse tree forever and *never* complete.)
ru: (В отличие от других примеров кода в этой документации, этот пример может выдавать разные результаты каждый раз, когда вы его запускаете, благодаря элементу случайности. Это очень маловероятно, но такая функция может бродить по дереву разбора вечно и *никогда* не завершиться.)

source: Advanced parser customization
ru: Расширенная настройка парсера

source: Beautiful Soup offers a number of ways to customize how the parser treats incoming HTML and XML. This section covers the most commonly used customization techniques.
ru: Beautiful Soup предлагает несколько способов настроить то, как парсер обрабатывает входящий HTML и XML. Этот раздел охватывает наиболее часто используемые методы настройки.

source: Parsing only part of a document
ru: Разбор части документа

source: Let's say you want to use Beautiful Soup to look at a document's <a> tags. It's a waste of time and memory to parse the entire document and then go over it again looking for <a> tags. It would be much faster to ignore everything that wasn't an <a> tag in the first place. The :py:class:`SoupStrainer` class allows you to choose which parts of an incoming document are parsed. You just create a :py:class:`SoupStrainer` and pass it in to the :py:class:`BeautifulSoup` constructor as the ``parse_only`` argument.
ru: Допустим, вы хотите использовать Beautiful Soup, чтобы посмотреть на теги <a> в документе. Было бы бесполезной тратой времени и памяти разбирать весь документ и затем снова проходить по нему в поисках тегов <a>. Намного быстрее изначательно игнорировать все, что не является тегом <a>. Класс :py:class:`SoupStrainer` позволяет выбрать, какие части входящего документа разбирать. Вы просто создаете :py:class:`SoupStrainer` и передаете его в конструктор :py:class:`BeautifulSoup` в качестве аргумента ``parse_only``.

source: (Note that *this feature won't work if you're using the html5lib parser*. If you use html5lib, the whole document will be parsed, no matter what. This is because html5lib constantly rearranges the parse tree as it works, and if some part of the document didn't actually make it into the parse tree, it'll crash. To avoid confusion, in the examples below I'll be forcing Beautiful Soup to use Python's built-in parser.)
ru: (Обратите внимание, что *эта функция не будет работать, если вы используете парсер html5lib*. Если вы используете html5lib, будет разобран весь документ, независимо от обстоятельств. Это потому что html5lib постоянно переставляет части дерева разбора в процессе работы, и если какая-то часть документа не попала в дерево разбора, все рухнет. Чтобы избежать путаницы, в примерах ниже я принудительно использую встроенный в Python парсер HTML.)

source: The :py:class:`SoupStrainer` class takes the same arguments as a typical method from `Searching the tree`_: :ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, and :ref:`**kwargs <kwargs>`. Here are three :py:class:`SoupStrainer` objects::
ru: Класс :py:class:`SoupStrainer` принимает те же аргументы, что и типичный метод из раздела `Поиск по дереву`_: :ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>` и :ref:`**kwargs <kwargs>`. Вот три объекта :py:class:`SoupStrainer`::

source: I'm going to bring back the "three sisters" document one more time, and we'll see what the document looks like when it's parsed with these three :py:class:`SoupStrainer` objects::
ru: Вернемся к фрагменту из «Алисы в стране чудес» и увидим, как выглядит документ, когда он разобран с этими тремя объектами :py:class:`SoupStrainer`::

source: The :py:class:`SoupStrainer` behavior is as follows:
ru: Поведение :py:class:`SoupStrainer` выглядит следующим образом:

source: When a tag matches, it is kept (including all its contents, whether they also match or not).
ru: Если тег совпадает, он сохраняется (включая все его содержимое, независимо от того, подходит оно или нет).

source: When a tag does not match, the tag itself is not kept, but parsing continues into its contents to look for other tags that do match.
ru: Если тег не подходит, сам тег не сохраняется, но анализ его содержимого продолжается для поиска других тегов, которые подходят.

source: Customizing multi-valued attributes
ru: Настройка многозначных атрибутов

source: In an HTML document, an attribute like ``class`` is given a list of values, and an attribute like ``id`` is given a single value, because the HTML specification treats those attributes differently::
ru: В документе HTML атрибуту вроде ``class`` присваивается список значений, а атрибуту вроде ``id`` присваивается одно значение, потому что спецификация HTML трактует эти атрибуты по-разному::

source: You can turn this off by passing in ``multi_valued_attributes=None``. Than all attributes will be given a single value::
ru: Вы можете отключить многозначные атрибуты, передав ``multi_valued_attributes=None``. Все атрибуты получат единственное значение::

source: You can customize this behavior quite a bit by passing in a dictionary for ``multi_valued_attributes``. If you need this, look at ``HTMLTreeBuilder.DEFAULT_CDATA_LIST_ATTRIBUTES`` to see the configuration Beautiful Soup uses by default, which is based on the HTML specification.
ru: Вы можете слегка изменить это поведение, передав в ``multi_valued_attributes`` словарь. Если вам это нужно, взгляните на ``HTMLTreeBuilder.DEFAULT_CDATA_LIST_ATTRIBUTES``, чтобы увидеть конфигурацию Beautiful Soup, которая используется по умолчанию и которая основана на спецификации HTML.

source: *(This is a new feature in Beautiful Soup 4.8.0.)*
ru: *(Это новая функция в Beautiful Soup 4.8.0.)*

source: Handling duplicate attributes
ru: Обработка дублирующих атрибутов

source: When using the ``html.parser`` parser, you can use the ``on_duplicate_attribute`` constructor argument to customize what Beautiful Soup does when it encounters a tag that defines the same attribute more than once::
ru: С парсером ``html.parser`` вы можете использовать в конструкторе аргумент ``on_duplicate_attribute``. С помощью этого аргумента можно указать Beautiful Soup, что следует делать с тегом, в котором более одного раза определен один и тот же атрибут::

source: The default behavior is to use the last value found for the tag::
ru: Поведение по умолчанию — использовать последнее найденное в теге значение::

source: With ``on_duplicate_attribute='ignore'`` you can tell Beautiful Soup to use the *first* value found and ignore the rest::
ru: С помощью ``on_duplicate_attribute = 'ignore'`` вы можете указать Beautiful Soup использовать *первое* найденное значение и игнорировать остальные::

source: (lxml and html5lib always do it this way; their behavior can't be configured from within Beautiful Soup.)
ru: (lxml и html5lib всегда делают это именно так; их поведение нельзя изменить изнутри Beautiful Soup.)

source: If you need more control, you can pass in a function that's called on each duplicate value::
ru: Если вам нужно больше, вы можете передать функцию, которая вызывается для каждого дублирующего значения::

source: *(This is a new feature in Beautiful Soup 4.9.1.)*
ru: *(Это новая функция в Beautiful Soup 4.9.1.)*

source: Instantiating custom subclasses
ru: Создание пользовательских подклассов

source: When a parser tells Beautiful Soup about a tag or a string, Beautiful Soup will instantiate a :py:class:`Tag` or :py:class:`NavigableString` object to contain that information. Instead of that default behavior, you can tell Beautiful Soup to instantiate *subclasses* of :py:class:`Tag` or :py:class:`NavigableString`, subclasses you define with custom behavior::
ru: Когда парсер сообщает Beautiful Soup о теге или строке, Beautiful Soup создает экземпляр объекта :py:class:`Tag` или :py:class:`NavigableString`, чтобы поместить туда эту информацию. Вместо этого поведения по умолчанию вы можете указать Beautiful Soup создавать экземпляр *подклассов* для :py:class:`Tag` или :py:class:`NavigableString`. Для этих подклассов вы определяете нужное вам поведение::

source: This can be useful when incorporating Beautiful Soup into a test framework.
ru: Это может быть полезно при включении Beautiful Soup в тестовый фреймворк.

source: *(This is a new feature in Beautiful Soup 4.8.1.)*
ru: *(Это новая функция в Beautiful Soup 4.8.1.)*

source: Troubleshooting
ru: Устранение неисправностей

source: If you're having trouble understanding what Beautiful Soup does to a document, pass the document into the ``diagnose()`` function. (This function is new in Beautiful Soup 4.2.0.) Beautiful Soup will print out a report showing you how different parsers handle the document, and tell you if you're missing a parser that Beautiful Soup could be using::
ru: Если у вас возникли проблемы с пониманием того, что Beautiful Soup делает с документом, передайте документ в функцию ``Diagnose()``. (Новое в Beautiful Soup 4.2.0.) Beautiful Soup выведет отчет, показывающий, как разные парсеры обрабатывают документ, и сообщит вам, если отсутствует парсер, который Beautiful Soup мог бы использовать::

source: Just looking at the output of diagnose() might show you how to solve the problem. Even if not, you can paste the output of ``diagnose()`` when asking for help.
ru: Простой взгляд на вывод diagnose() может показать, как решить проблему. Если это и не поможет, вы можете скопировать вывод ``Diagnose()``, когда обратитесь за помощью.

source: Errors when parsing a document
ru: Ошибки при разборе документа

source: There are two different kinds of parse errors. There are crashes, where you feed a document to Beautiful Soup and it raises an exception (usually an ``HTMLParser.HTMLParseError``). And there is unexpected behavior, where a Beautiful Soup parse tree looks a lot different than the document used to create it.
ru: Существует два вида ошибок разбора. Есть сбои, когда вы подаете документ в Beautiful Soup, и это поднимает исключение, обычно ``HTMLParser.HTMLParseError``. И есть неожиданное поведение, когда дерево разбора Beautiful Soup сильно отличается от документа, использованного для создания дерева.
