Repository: authoress/bs4ru
Catalog: doc_bs4_4.13.3/locale/*/LC_MESSAGES/bs4ru.po
Languages: ru

source: In the first example, the string "Elsie" showed up, even though it was contained within the <a> tag we started from. In the second example, the last <p> tag in the document showed up, even though it's not in the same part of the tree as the <a> tag we started from. For these methods, all that matters is that an element matches the filter and it shows up later in the document in :ref:`document order <document-order>`.
ru: В первом примере нашлась строка "Elsie", хотя она содержится в теге <a>, с которого мы начали. Во втором примере нашелся последний тег <p>, хотя он находится в другой части дерева, чем тег <a>, с которого мы начали. Для этих методов имеет значение только то, что элемент соответствует фильтру и появляется в документе позже, в соответствии с :ref:`порядком документа <document-order>`.

source: ``find_all_previous()`` and ``find_previous()``
ru: ``find_all_previous()`` и ``find_previous()``

source: Method signature: find_all_previous(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_all_previous(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`limit <limit>`, :ref:`**kwargs <kwargs>`)

source: Method signature: find_previous(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)
ru: Сигнатура метода: find_previous(:ref:`name <name>`, :ref:`attrs <attrs>`, :ref:`string <string>`, :ref:`**kwargs <kwargs>`)

source: These methods use :ref:`.previous_elements <element-generators>` to iterate over the tags and strings that came before it in the document. The ``find_all_previous()`` method returns all matches, and ``find_previous()`` only returns the first match::
ru: Эти методы используют :ref:`.previous_elements <element-generators>` для перебора любых тегов и строк, которые встречаются в документе до элемента. Метод ``find_all_previous()`` возвращает все совпадения, а ``find_previous()`` только первое::

source: The call to ``find_all_previous("p")`` found the first paragraph in the document (the one with class="title"), but it also finds the second paragraph, the <p> tag that contains the <a> tag we started with. This shouldn't be too surprising: we're looking at all the tags that show up earlier in the document in :ref:`document order <document-order>` than the one we started with. A <p> tag that contains an <a> tag must have shown up before the <a> tag it contains.
ru: Вызов ``find_all_previous ("p")`` нашел первый абзац в документе (тот, который с ``class = "title"``), но он также находит второй абзац, а именно тег <p>, содержащий тег <a>, с которого мы начали. Это не так уж удивительно: мы смотрим на все теги, которые появляются в :ref:`порядке документа <document-order>` раньше , чем тот, с которого мы начали. Тег <p>, содержащий тег <a>, должен был появиться до тега <a>, который в нем содержится.

source: CSS selectors through the ``.css`` property
ru: CSS-селекторы через свойство ``.css``

source: :py:class:`BeautifulSoup` and :py:class:`Tag` objects support CSS selectors through their ``.css`` property. The actual selector implementation is handled by the `Soup Sieve <https://facelessuser.github.io/soupsieve/>`_ package, available on PyPI as ``soupsieve``. If you installed Beautiful Soup through ``pip``, Soup Sieve was installed at the same time, so you don't have to do anything extra.
ru: Объекты :py:class:`BeautifulSoup` и :py:class:`Tag` поддерживают селекторы CSS через свойство ``.css``. Фактическая реализация селектора обрабатывается пакетом `Soup Sieve <https://facelessuser.github.io/soupsieve/>`_, доступным в PyPI как ``soupsieve``. Если вы установили Beautiful Soup через pip, одновременно должен был установиться Soup Sieve, поэтому вам не нужно больше ничего делать.

source: The Soup Sieve documentation lists `all the currently supported CSS selectors <https://facelessuser.github.io/soupsieve/selectors/>`_, but here are some of the basics. You can find tags by name::
ru: В `документации SoupSieve <https://facelessuser.github.io/soupsieve/>`_ перечислены все селекторы CSS, которые поддерживаются на данный момент, но вот некоторые из основных. Вы можете найти тег по имени::

source: Find tags by ID::
ru: Найти теги по ID::

source: Find tags contained anywhere within other tags::
ru: Найти теги внутри других тегов на любом уровне вложенности::

source: Find tags *directly* within other tags::
ru: Найти теги *непосредственно* внутри других тегов::

source: Find all matching next siblings of tags::
ru: Найти все подходящие одноуровневые элементы тега, следующие за ним::

source: Find the next sibling tag (but only if it matches)::
ru: Найти следующий одноуровневый тег (но только если он подходит)::

source: Find tags by CSS class::
ru: Найти теги по классу CSS::

source: Find tags that match any selector from a list of selectors::
ru: Найти теги, которые соответствуют любому селектору из списка::

source: Test for the existence of an attribute::
ru: Проверка на наличие атрибута::

source: Find tags by attribute value::
ru: Найти теги по значению атрибута::

source: There's also a method called ``select_one()``, which finds only the first tag that matches a selector::
ru: Есть также метод ``select_one()``, который находит только первый тег, соответствующий селектору::

source: As a convenience, you can call ``select()`` and ``select_one()`` can directly on the :py:class:`BeautifulSoup` or :py:class:`Tag` object, omitting the ``.css`` property::
ru: Для удобства вы можете вызвать метод select() и метод select_one() непосредственно для объекта :py:class:`BeautifulSoup` или :py:class:`Tag`, опуская свойство ``.css``::

source: CSS selector support is a convenience for people who already know the CSS selector syntax. You can do all of this with the Beautiful Soup API. If CSS selectors are all you need, you should skip Beautiful Soup altogether and parse the document with ``lxml``: it's a lot faster. But Soup Sieve lets you *combine* CSS selectors with the Beautiful Soup API.
ru: Селекторы CSS удобны для тех, кто уже знаком с синтаксисом селекторов CSS. Вы можете сделать все это с помощью Beautiful Soup API. И если CSS селекторы — это все, что вам нужно, вам следует использовать парсер lxml: так будет намного быстрее. Но вы можете *комбинировать* селекторы CSS с Beautiful Soup API.

source: Advanced Soup Sieve features
ru: Расширенные возможности Soup Sieve

source: Soup Sieve offers a substantial API beyond the ``select()`` and ``select_one()`` methods, and you can access most of that API through the ``.css`` attribute of :py:class:`Tag` or :py:class:`BeautifulSoup`. What follows is just a list of the supported methods; see `the Soup Sieve documentation <https://facelessuser.github.io/soupsieve/>`_ for full documentation.
ru: Soup Sieve предлагает обширный API, помимо методов ``select()`` и ``select_one()``, и вы можете получить доступ к большей части этого API через атрибут .css :py:class:`Tag` или :py:class:`BeautifulSoup`. Далее следует лишь список поддерживаемых методов; полное руководство см. в `документации Soup Sieve <https://facelessuser.github.io/soupsieve/>`_.

source: The ``iselect()`` method works the same as ``select()``, but it returns a generator instead of a list::
ru: Метод ``iselect()`` работает так же, как ``select()``, но вместо списка возвращает генератор::

source: The ``closest()`` method returns the nearest parent of a given :py:class:`Tag` that matches a CSS selector, similar to Beautiful Soup's ``find_parent()`` method::
ru: Метод ``closest()`` возвращает ближайшего родителя данного :py:class:`Tag`, который соответствует селектору CSS, аналогично методу ``find_parent()`` в Beautiful Soup::

source: The ``match()`` method returns a Boolean depending on whether or not a specific :py:class:`Tag` matches a selector::
ru: Метод ``match()`` возвращает логическое значение в зависимости от того, соответствует ли конкретный :py:class:`Tag` селектору::

source: The ``filter()`` method returns the subset of a tag's direct children that match a selector::
ru: Метод ``filter()`` возвращает подмножество прямых дочерних элементов тега, соответствующих селектору::

source: The ``escape()`` method escapes CSS identifiers that would otherwise be invalid::
ru: Метод ``escape()`` экранирует идентификаторы CSS, которые в противном случае были бы недействительны::

source: Namespaces in CSS selectors
ru: Пространства имен в селекторах CSS

source: If you've parsed XML that defines namespaces, you can use them in CSS selectors.::
ru: Если вы разобрали XML, в котором определены пространства имен, вы можете использовать их в селекторах CSS::

source: Beautiful Soup tries to use namespace prefixes that make sense based on what it saw while parsing the document, but you can always provide your own dictionary of abbreviations::
ru: Beautiful Soup пытается использовать префиксы пространства имен, которые имеют смысл в зависимости от того, что он увидел при разборе документа, но вы всегда можете предоставить свой словарь сокращений::

source: History of CSS selector support
ru: История поддержки селекторов CSS

source: The ``.css`` property was added in Beautiful Soup 4.12.0. Prior to this, only the ``.select()`` and ``.select_one()`` convenience methods were supported.
ru: Свойство ``.css`` было добавлено в Beautiful Soup 4.12.0. До этого поддерживались только методы ``.select()`` и ``.select_one()``.

source: The Soup Sieve integration was added in Beautiful Soup 4.7.0. Earlier versions had the ``.select()`` method, but only the most commonly-used CSS selectors were supported.
ru: Интеграция Soup Sieve была добавлена в Beautiful Soup 4.7.0. В более ранних версиях также есть метод ``.select()``, но поддерживаются только самые часто используемые селекторы CSS.

source: Modifying the tree
ru: Изменение дерева

source: Beautiful Soup's main strength is in searching the parse tree, but you can also modify the tree and write your changes as a new HTML or XML document.
ru: Основная сила Beautiful Soup в поиске по дереву разбора, но вы также можете изменить дерево и записать свои изменения в виде нового HTML или XML-документа.

source: Changing tag names and attributes
ru: Изменение имен тегов и атрибутов

source: I covered this earlier, in :py:attr:`Tag.attrs`, but it bears repeating. You can rename a tag, change the values of its attributes, add new attributes, and delete attributes::
ru: Я говорил об этом раньше, в разделе :py:attr:`Tag.attrs`, но это стоит повторить. Вы можете переименовать тег, изменить значения его атрибутов, добавить новые атрибуты и удалить атрибуты::

source: Modifying ``.string``
ru: Изменение ``.string``

source: If you set a tag's ``.string`` attribute to a new string, the tag's contents are replaced with that string::
ru: Если вы замените значение атрибута ``.string`` новой строкой, содержимое тега будет заменено на эту строку::

source: Be careful: if the tag contained other tags, they and all their contents will be destroyed.
ru: Будьте осторожны: если тег содержит другие теги, они и все их содержимое будут уничтожены.

source: You can add to a tag's contents with ``Tag.append()``. It works just like calling ``.append()`` on a Python list::
ru: Вы можете добавить содержимое тега с помощью ``Tag.append()``. Это работает точно так же, как ``.append()`` для списка в Python::

source: ``Tag.append()`` returns the newly appended element.
ru: ``Tag.append()`` возвращает недавно добавленный элемент.

source: Starting in Beautiful Soup 4.7.0, :py:class:`Tag` also supports a method called ``.extend()``, which adds every element of a list to a :py:class:`Tag`, in order::
ru: Начиная с версии Beautiful Soup 4.7.0, :py:class:`Tag` также поддерживает метод ``.extend()``, который добавляет каждый элемент списка в :py:class:`Tag` по порядку::

source: ``Tag.extend()`` returns the list of appended elements.
ru: ``Tag.extend()`` возвращает список присоединенных элементов.

source: ``NavigableString()`` and ``.new_tag()``
ru: ``NavigableString()`` и ``.new_tag()``

source: If you need to add a string to a document, no problem—you can pass a Python string in to ``append()``, or you can call the :py:class:`NavigableString` constructor::
ru: Если вам нужно добавить строку в документ, нет проблем — вы можете передать строку Python в ``append()`` или вызвать конструктор :py:class:`NavigableString`::

source: If you want to create a comment or some other subclass of :py:class:`NavigableString`, just call the constructor::
ru: Если вы хотите создать комментарий или другой подкласс :py:class:`NavigableString`, просто вызовите конструктор::

source: *(This is a new feature in Beautiful Soup 4.4.0.)*
ru: (Это новая функция в Beautiful Soup 4.4.0.)

source: What if you need to create a whole new tag? The best solution is to call the factory method ``BeautifulSoup.new_tag()``::
ru: Что делать, если вам нужно создать совершенно новый тег? Наилучшим решением будет вызвать фабричный метод ``BeautifulSoup.new_tag()``::

source: Only the first argument, the tag name, is required.
ru: Нужен только первый аргумент, имя тега.

source: *(The ``string`` argument to ``new_tag`` was introduced in Beautiful Soup 4.13.0.)*
ru: *(Аргумент ``string`` для ``new_tag`` был введен в Beautiful Soup 4.13.0.)*

source: Because insertion methods return the newly inserted element, you can create, insert, and obtain an element in one step::
ru: Поскольку методы вставки возвращают недавно вставленный элемент, вы можете создать, вставить и получить элемент за один шаг::

source: ``Tag.insert()`` is just like ``Tag.append()``, except the new element doesn't necessarily go at the end of its parent's ``.contents``. It will be inserted at whatever numeric position you say, similar to ``.insert()`` on a Python list::
ru: ``Tag.insert()`` похож на ``Tag.append()``, за исключением того, что новый элемент не обязательно добавляется в конец родительского ``.contents``. Он добавится в любое место, номер которого вы укажете. Это работает в точности как ``.insert()`` в списке Python::

source: You can pass more than one element into ``Tag.insert()``. All the elements will be inserted, starting at the numeric position you provide.
ru: Вы можете передать более одного элемента в ``Tag.insert()``. Все элементы будут вставлены, начиная с указанной вами числовой позиции.

source: ``Tag.insert()`` returns the list of newly inserted elements.
ru: ``Tag.insert()`` возвращает список недавно вставленных элементов.

source: ``insert_before()`` and ``insert_after()``
ru: ``insert_before()`` и ``insert_after()``

source: The ``insert_before()`` method inserts tags or strings immediately before something else in the parse tree::
ru: Метод ``insert_before()`` вставляет теги или строки непосредственно перед чем-то в дереве разбора::

source: The ``insert_after()`` method inserts tags or strings immediately after something else in the parse tree::
ru: Метод ``insert_after()`` вставляет теги или строки непосредственно после чего-то в дереве разбора::

source: Both methods return the list of newly inserted elements.
ru: Оба метода возвращают список недавно вставленных элементов.

source: ``Tag.clear()`` removes the contents of a tag::
ru: ``Tag.clear()`` удаляет содержимое тега::

source: ``PageElement.extract()`` removes a tag or string from the tree. It returns the tag or string that was extracted::
ru: ``PageElement.extract()`` удаляет тег или строку из дерева. Он возвращает тег или строку, которая была извлечена::

source: At this point you effectively have two parse trees: one rooted at the :py:class:`BeautifulSoup` object you used to parse the document, and one rooted at the tag that was extracted. You can go on to call ``extract()`` on a child of the element you extracted::
ru: К этому моменту у вас фактически есть два дерева разбора: одно в объекте :py:class:`BeautifulSoup`, который вы использовали, чтобы разобрать документ, другое в теге, который был извлечен. Вы можете далее вызывать ``extract`` в отношении дочернего элемента того тега, который был извлечен::

source: ``Tag.decompose()`` removes a tag from the tree, then *completely destroys it and its contents*::
ru: ``Tag.decompose()`` удаляет тег из дерева, а затем *полностью уничтожает его вместе с его содержимым*::

source: The behavior of a decomposed :py:class:`Tag` or :py:class:`NavigableString` is not defined and you should not use it for anything. If you're not sure whether something has been decomposed, you can check its ``.decomposed`` property *(new in Beautiful Soup 4.9.0)*::
ru: Поведение уничтоженного :py:class:`Tag` или :py:class:`NavigableString` не определено, и вам не следует его использовать. Если вы не уверены, было ли что-то уничтожено, вы можете проверить по его свойству ``decomposed`` *(новое в Beautiful Soup 4.9.0)*::

source: ``PageElement.replace_with()`` extracts a tag or string from the tree, then replaces it with one or more tags or strings of your choice::
ru: ``PageElement.extract()`` извлекает тег или строку из дерева и заменяет его одним или несколькими тегами либо строками по вашему выбору::

source: ``replace_with()`` returns the tag or string that got replaced, so that you can examine it or add it back to another part of the tree.
ru: ``replace_with()`` возвращает тег или строку, которые были заменены, так что вы можете изучить его или добавить его обратно в другую часть дерева.

source: *The ability to pass multiple arguments into replace_with() is new in Beautiful Soup 4.10.0.*
ru: *Возможность передавать несколько аргументов в replace_with() является новой в Beautiful Soup 4.10.0.*

source: ``PageElement.wrap()`` wraps an element in the :py:class:`Tag` object you specify. It returns the new wrapper::
ru: ``PageElement.wrap()`` обертывает элемент в указанный вами объект :py:class:`Tag`. Он возвращает новую обертку::

source: *This method is new in Beautiful Soup 4.0.5.*
ru: *Это новый метод в Beautiful Soup 4.0.5.*

source: ``Tag.unwrap()`` is the opposite of ``wrap()``. It replaces a tag with whatever's inside that tag. It's good for stripping out markup::
ru: ``Tag.unwrap()`` — это противоположность ``wrap()``. Он заменяет весь тег на его содержимое. Этим методом удобно очищать разметку::

source: Like ``replace_with()``, ``unwrap()`` returns the tag that was replaced.
ru: Как и ``replace_with()``, ``unwrap()`` возвращает тег, который был заменен.

source: After calling a bunch of methods that modify the parse tree, you may end up with two or more :py:class:`NavigableString` objects next to each other. Beautiful Soup doesn't have any problems with this, but since it can't happen in a freshly parsed document, you might not expect behavior like the following::
ru: После вызова ряда методов, которые изменяют дерево разбора, у вас может оказаться несколько объектов :py:class:`NavigableString` подряд. У Beautiful Soup с этим нет проблем, но поскольку такое не случается со свежеразобранным документом, вам может показаться неожиданным следующее поведение::

source: You can call ``Tag.smooth()`` to clean up the parse tree by consolidating adjacent strings::
ru: Вы можете вызвать ``Tag.smooth()``, чтобы очистить дерево разбора путем объединения смежных строк::

source: *This method is new in Beautiful Soup 4.8.0.*
ru: *Это новый метод в Beautiful Soup 4.8.0.*

source: Output
ru: Вывод

source: Pretty-printing
ru: Красивое форматирование

source: The ``prettify()`` method will turn a Beautiful Soup parse tree into a nicely formatted Unicode string, with a separate line for each tag and each string::
ru: Метод ``prettify()`` превратит дерево разбора Beautiful Soup в красиво отформатированную строку Unicode, где каждый тег и каждая строка выводятся на отдельной строчке::

source: You can call ``prettify()`` on the top-level :py:class:`BeautifulSoup` object, or on any of its :py:class:`Tag` objects::
ru: Вы можете вызвать ``prettify()`` для объекта :py:class:`BeautifulSoup` верхнего уровня или для любого из его объектов :py:class:`Tag`::

source: Since it adds whitespace (in the form of newlines), ``prettify()`` changes the meaning of an HTML document and should not be used to reformat one. The goal of ``prettify()`` is to help you visually understand the structure of the documents you work with.
ru: Добавляя переводы строк (``\n``), метод ``prettify()`` изменяет значение документа HTML и не должен использоваться для переформатирования. Цель ``prettify()`` — помочь вам визуально понять структуру документов, с которыми вы работаете.

source: Non-pretty printing
ru: Без красивого форматирования

source: If you just want a string, with no fancy formatting, you can call ``str()`` on a :py:class:`BeautifulSoup` object, or on a :py:class:`Tag` within it::
ru: Если вам нужна просто строка, без особого форматирования, вы можете вызвать ``str()`` для объекта :py:class:`BeautifulSoup` или для объекта :py:class:`Tag` внутри него::

source: The ``str()`` function returns a string encoded in UTF-8. See `Encodings`_ for other options.
ru: Функция ``str()`` возвращает строку, кодированную в UTF-8. Для получения более подробной информации см. `Кодировки`_.

source: You can also call ``encode()`` to get a bytestring, and ``decode()`` to get Unicode.
ru: Вы также можете вызвать ``encode()`` для получения байтовой строки, и ``decode()``, чтобы получить Unicode.

source: Output formatters
ru: Средства форматирования вывода

source: If you give Beautiful Soup a document that contains HTML entities like "&lquot;", they'll be converted to Unicode characters::
ru: Если вы дадите Beautiful Soup документ, который содержит HTML-мнемоники, такие как "&lquot;", они будут преобразованы в символы Unicode::

source: If you then convert the document to a bytestring, the Unicode characters will be encoded as UTF-8. You won't get the HTML entities back::
ru: Если затем преобразовать документ в байтовую строку, символы Unicode будут кодироваться как UTF-8. Вы не получите обратно HTML-мнемоники::

source: By default, the only characters that are escaped upon output are bare ampersands and angle brackets. These get turned into "&amp;", "&lt;", and "&gt;", so that Beautiful Soup doesn't inadvertently generate invalid HTML or XML::
ru: По умолчанию единственные символы, которые экранируются при выводе — это чистые амперсанды и угловые скобки. Они превращаются в «&», «<» и ">", чтобы Beautiful Soup случайно не сгенерировал невалидный HTML или XML::

source: You can change this behavior by providing a value for the ``formatter`` argument to ``prettify()``, ``encode()``, or ``decode()``. Beautiful Soup recognizes five possible values for ``formatter``.
ru: Вы можете изменить это поведение, указав для аргумента ``formatter`` одно из значений: ``prettify()``, ``encode()`` или ``decode()``. Beautiful Soup распознает пять возможных значений ``formatter``.

source: The default is ``formatter="minimal"``. Strings will only be processed enough to ensure that Beautiful Soup generates valid HTML/XML::
ru: Значение по умолчанию — ``formatter="minimal"``. Строки будут обрабатываться ровно настолько, чтобы Beautiful Soup генерировал валидный HTML / XML::

source: If you pass in ``formatter="html"``, Beautiful Soup will convert Unicode characters to HTML entities whenever possible::
ru: Если вы передадите ``formatter = "html"``, Beautiful Soup преобразует символы Unicode в HTML-мнемоники, когда это возможно::

source: If you pass in ``formatter="html5"``, it's similar to ``formatter="html"``, but Beautiful Soup will omit the closing slash in HTML void tags like "br"::
ru: Если вы передаете ``formatter="html5"``, это то же самое, что ``formatter="html"``, только Beautiful Soup будет пропускать закрывающую косую черту в пустых тегах HTML, таких как "br"::
