Repository: authoress/bs4ru
Catalog: doc_bs4_4.13.3/locale/*/LC_MESSAGES/bs4ru.po
Languages: ru

source: In addition, any attributes whose values are the empty string will become HTML-style Boolean attributes::
ru: Кроме того, любые атрибуты, значения которых являются пустой строкой станут логическими атрибутами в стиле HTML::

source: *(This behavior is new as of Beautiful Soup 4.10.0.)*
ru: *(Это новое поведение в Beautiful Soup 4.10.0.)*

source: If you pass in ``formatter=None``, Beautiful Soup will not modify strings at all on output. This is the fastest option, but it may lead to Beautiful Soup generating invalid HTML/XML, as in these examples::
ru: Если вы передадите ``formatter=None``, Beautiful Soup вообще не будет менять строки на выходе. Это самый быстрый вариант, но он может привести к тому, что Beautiful Soup будет генерировать невалидный HTML / XML::

source: Formatter objects
ru: Объекты форматирования

source: If you need more sophisticated control over your output, you can instantiate one of Beautiful Soup's formatter classes and pass that object in as ``formatter``.
ru: Если вам нужен более сложный контроль над выводом, вы можете создать экземпляр одного из классов форматирования Beautiful Soup и передать этот объект как ``formatter``.

source: Used to customize the formatting rules for HTML documents.
ru: Используется для настройки правил форматирования HTML-документов.

source: Here's a formatter that converts strings to uppercase, whether they occur in a string object or an attribute value::
ru: Вот как можно преобразовать строки в верхний регистр, независимо от того, находятся ли они в строковом объекте или в значении атрибута::

source: Here's a formatter that increases the indentation width when pretty-printing::
ru: Так можно увеличить отступ при красивом форматировании::

source: Used to customize the formatting rules for XML documents.
ru: Используется для настройки правил форматирования XML-документов.

source: Writing your own formatter
ru: Написание собственного форматтера

source: Subclassing :py:class:`HTMLFormatter` or :py:class:`XMLFormatter` will give you even more control over the output. For example, Beautiful Soup sorts the attributes in every tag by default::
ru: Подклассы :py:class:`HTMLFormatter` или :py:class:`XMLFormatter` дают еще больший контроль над выводом. Например, Beautiful Soup сортирует атрибуты в каждом теге по умолчанию::

source: To turn this off, you can subclass the ``Formatter.attributes()`` method, which controls which attributes are output and in what order. This implementation also filters out the attribute called "m" whenever it appears::
ru: Чтобы выключить сортировку по умолчанию, вы можете создать подкласс на основе метода ``Formatter.attributes()``, который контролирует, какие атрибуты выводятся и в каком порядке. Эта реализация также отфильтровывает атрибут с именем "m", где бы он ни появился::

source: One last caveat: if you create a :py:class:`CData` object, the text inside that object is always presented *exactly as it appears, with no formatting*. Beautiful Soup will call your entity substitution function, just in case you've written a custom function that counts all the strings in the document or something, but it will ignore the return value::
ru: Последнее предостережение: если вы создаете объект :py:class:`CData`, текст внутри этого объекта всегда представлен *как есть, без какого-либо форматирования*. Beautiful Soup вызовет вашу функцию для замены мнемоник, на тот случай, если вы написали функцию, которая подсчитывает все строки в документе или что-то еще, но он будет игнорировать возвращаемое значение::

source: If you only want the human-readable text inside a document or tag, you can use the ``get_text()`` method. It returns all the text in a document or beneath a tag, as a single Unicode string::
ru: Если вам нужен только человекочитаемый текст внутри документа или тега, используйте метод ``get_text()``. Он возвращает весь текст документа или тега в виде единственной строки Unicode::

source: You can specify a string to be used to join the bits of text together::
ru: Вы можете указать строку, которая будет использоваться для объединения текстовых фрагментов в единую строку::

source: You can tell Beautiful Soup to strip whitespace from the beginning and end of each bit of text::
ru: Вы можете сказать Beautiful Soup удалять пробелы в начале и конце каждого текстового фрагмента::

source: But at that point you might want to use the :ref:`.stripped_strings <string-generators>` generator instead, and process the text yourself::
ru: Но в этом случае вы можете предпочесть использовать генератор :ref:`.stripped_strings <string-generators>` и затем обработать текст самостоятельно::

source: *As of Beautiful Soup version 4.9.0, when lxml or html.parser are in use, the contents of <script>, <style>, and <template> tags are generally not considered to be 'text', since those tags are not part of the human-visible content of the page.*
ru: *Начиная с версии Beautiful Soup 4.9.0, в которой используются парсеры lxml или html.parser, содержание тегов <script>, <style> и <template> обычно не считается 'текстом', так как эти теги не являются частью воспринимаемого человеком содержания страницы.*

source: *As of Beautiful Soup version 4.10.0, you can call get_text(), .strings, or .stripped_strings on a NavigableString object. It will either return the object itself, or nothing, so the only reason to do this is when you're iterating over a mixed list.*
ru: *Начиная с Beautiful Soup версии 4.10.0, вы можете вызывать get_text(), .strings или .stripped_strings в объекте NavigableString. Это вернет либо сам объект, либо ничего, поэтому единственный случай, когда стоит это делать — это когда вы перебираете смешанный список (mixed list).*

source: *As of Beautiful Soup version 4.13.0, you can call .string on a NavigableString object. It will return the object itself, so again, the only reason to do this is when you're iterating over a mixed list.*
ru: *Начиная с версии Beautiful Soup 4.13.0, вы можете вызывать .string для объекта NavigableString. Он вернет сам объект, так что, повторюсь, единственная причина делать это — когда вы перебираете смешанный список*

source: Specifying the parser to use
ru: Указание парсера

source: If you just need to parse some HTML, you can dump the markup into the :py:class:`BeautifulSoup` constructor, and it'll probably be fine. Beautiful Soup will pick a parser for you and parse the data. But there are a few additional arguments you can pass in to the constructor to change which parser is used.
ru: Если вам нужно просто разобрать HTML, вы можете скинуть разметку в конструктор :py:class:`BeautifulSoup`, и, скорее всего, все будет в порядке. Beautiful Soup подберет для вас парсер и проанализирует данные. Но есть несколько дополнительных аргументов, которые вы можете передать конструктору, чтобы изменить используемый парсер.

source: The first argument to the :py:class:`BeautifulSoup` constructor is a string or an open filehandle—the source of the markup you want parsed. The second argument is *how* you'd like the markup parsed.
ru: Первым аргументом конструктора :py:class:`BeautifulSoup` является строка или открытый дескриптор файла — сама разметка, которую вы хотите разобрать. Второй аргумент — это *как* вы хотите, чтобы разметка была разобрана.

source: If you don't specify anything, you'll get the best HTML parser that's installed. Beautiful Soup ranks lxml's parser as being the best, then html5lib's, then Python's built-in parser. You can override this by specifying one of the following:
ru: Если вы ничего не укажете, будет использован лучший HTML-парсер из тех, которые установлены. Beautiful Soup оценивает парсер lxml как лучший, за ним идет html5lib, затем встроенный парсер Python. Вы можете переопределить используемый парсер, указав что-то из следующего:

source: What type of markup you want to parse. Currently supported values are "html", "xml", and "html5".
ru: Какой тип разметки вы хотите разобрать. В данный момент поддерживаются значения "html", "xml" и "html5".

source: The name of the parser library you want to use. Currently supported options are "lxml", "html5lib", and "html.parser" (Python's built-in HTML parser).
ru: Имя библиотеки парсера, которую вы хотите использовать. В данный момент поддерживаются "lxml", "html5lib" и "html.parser" (встроенный в Python парсер HTML).

source: The section `Installing a parser`_ contrasts the supported parsers.
ru: В разделе `Установка парсера`_ вы найдете сравнительную таблицу поддерживаемых парсеров.

source: If you ask for a parser that isn't installed, Beautiful Soup will raise an exception so that you don't inadvertently parse a document under an unknown set of rules. For example, right now, the only supported XML parser is lxml. If you don't have lxml installed, asking for an XML parser won't give you one, and asking for "lxml" won't work either.
ru: Если вы запросите парсер, который не установлен, Beautiful Soup сгенерирует исключение, чтобы вы случайно не проанализировали документ в соответствии с неизвестным набором правил. Например, на текущий момент единственный поддерживаемый парсер XML — это lxml. Если у вас не установлен lxml, запрос на парсер XML ничего не даст, и запрос "lxml" тоже не сработает.

source: Differences between parsers
ru: Различия между парсерами

source: Beautiful Soup presents the same interface to a number of different parsers, but each parser is different. Different parsers will create different parse trees from the same document. The biggest differences are between the HTML parsers and the XML parsers. Here's a short document, parsed as HTML using the parser that comes with Python::
ru: Beautiful Soup представляет один интерфейс для разных парсеров, но парсеры неодинаковы. Разные парсеры создадут различные деревья разбора из одного и того же документа. Самые большие различия будут между парсерами HTML и парсерами XML. Вот короткий документ, разобранный как HTML встроенным в Python парсером::

source: Since a standalone <b/> tag is not valid HTML, html.parser turns it into a <b></b> tag pair.
ru: Поскольку одиночный тег <b/> не является валидным кодом HTML, парсер преобразует его в пару тегов <b></b>.

source: Here's the same document parsed as XML (running this requires that you have lxml installed). Note that the standalone <b/> tag is left alone, and that the document is given an XML declaration instead of being put into an <html> tag.::
ru: Вот тот же документ, который разобран как XML (для его запуска нужно, чтобы был установлен lxml). Обратите внимание, что одиночный тег <b/> остается, и что в документ добавляется объявление XML вместо тега <html>::

source: There are also differences between HTML parsers. If you give Beautiful Soup a perfectly-formed HTML document, these differences won't matter. One parser will be faster than another, but they'll all give you a data structure that looks exactly like the original HTML document.
ru: Есть также различия между парсерами HTML. Если вы даете Beautiful Soup идеально оформленный документ HTML, эти различия не будут иметь значения. Один парсер будет быстрее другого, но все они будут давать структуру данных, которая выглядит точно так же, как оригинальный документ HTML.

source: But if the document is not perfectly-formed, different parsers will give different results. Here's a short, invalid document parsed using lxml's HTML parser. Note that the <a> tag gets wrapped in <body> and <html> tags, and the dangling </p> tag is simply ignored::
ru: Но если документ оформлен неидеально, различные парсеры дадут разные результаты. Вот короткий невалидный документ, разобранный с помощью HTML-парсера lxml. Обратите внимание, что тег <a> заключен в теги <body> и <html>, а висячий тег </p> просто игнорируется::

source: Here's the same document parsed using html5lib::
ru: Вот тот же документ, разобранный с помощью html5lib::

source: Instead of ignoring the dangling </p> tag, html5lib pairs it with an opening <p> tag. html5lib also adds an empty <head> tag; lxml didn't bother.
ru: Вместо того, чтобы игнорировать висячий тег </p>, html5lib добавляет открывающй тег <p>. html5lib также добавляет пустой тег <head>; lxml этого не сделал.

source: Here's the same document parsed with Python's built-in HTML parser::
ru: Вот тот же документ, разобранный с помощью встроенного в Python парсера HTML::

source: Like lxml, this parser ignores the closing </p> tag. Unlike html5lib or lxml, this parser makes no attempt to create a well-formed HTML document by adding <html> or <body> tags.
ru: Как и lxml, этот парсер игнорирует закрывающий тег </p>. В отличие от html5lib, этот парсер не делает попытки создать правильно оформленный HTML-документ, добавив теги <html> или <body>.

source: Since the document "<a></p>" is invalid, none of these techniques is the 'correct' way to handle it. The html5lib parser uses techniques that are part of the HTML5 standard, so it has the best claim on being the 'correct' way, but all three techniques are legitimate.
ru: Поскольку документ ``<a></p>`` невалиден, ни один из этих способов нельзя назвать "правильным". Парсер html5lib использует способы, которые являются частью стандарта HTML5, поэтому он может претендовать на то, что его подход самый "правильный", но правомерно использовать любой из трех методов.

source: Differences between parsers can affect your script. If you're planning on distributing your script to other people, or running it on multiple machines, you should specify a parser in the :py:class:`BeautifulSoup` constructor. That will reduce the chances that your users parse a document differently from the way you parse it.
ru: Различия между парсерами могут повлиять на ваш скрипт. Если вы планируете распространять ваш скрипт или запускать его на нескольких машинах, вам нужно указать парсер в конструкторе :py:class:`BeautifulSoup`. Это уменьшит вероятность того, что ваши пользователи при разборе документа получат результат, отличный от вашего.

source: Encodings
ru: Кодировки

source: Any HTML or XML document is written in a specific encoding like ASCII or UTF-8. But when you load that document into Beautiful Soup, you'll discover it's been converted to Unicode::
ru: Любой документ HTML или XML написан в определенной кодировке, такой как ASCII или UTF-8. Но когда вы загрузите этот документ в Beautiful Soup, вы обнаружите, что он был преобразован в Unicode::

source: It's not magic. (That sure would be nice.) Beautiful Soup uses a sub-library called `Unicode, Dammit`_ to detect a document's encoding and convert it to Unicode. The autodetected encoding is available as the ``.original_encoding`` attribute of the :py:class:`BeautifulSoup` object::
ru: Это не волшебство. (Хотя это было бы здорово, конечно.) Beautiful Soup использует подбиблиотеку под названием `Unicode, Dammit`_ для определения кодировки документа и преобразования ее в Unicode. Кодировка, которая была автоматически определена, содержится в значении атрибута ``.original_encoding`` объекта :py:class:`BeautifulSoup`::

source: If ``.original_encoding`` is ``None``, that means the document was already Unicode when it was passed into Beautiful Soup::
ru: Если ``.original_encoding`` имеет значение ``None``, это означает, что, когда документ передали в Beautiful Soup, он уже был в кодировке Unicode::

source: Unicode, Dammit guesses correctly most of the time, but sometimes it makes mistakes. Sometimes it guesses correctly, but only after a byte-by-byte search of the document that takes a very long time. If you happen to know a document's encoding ahead of time, you can avoid mistakes and delays by passing it to the :py:class:`BeautifulSoup` constructor as ``from_encoding``.
ru: Unicode, Dammit чаще всего угадывает правильно, но иногда делает ошибки. Иногда он угадывает правильно только после побайтового поиска по документу, что занимает очень много времени. Если вы вдруг уже знаете кодировку документа, вы можете избежать ошибок и задержек, передав кодировку конструктору :py:class:`BeautifulSoup` как аргумент ``from_encoding``.

source: Here's a document written in ISO-8859-8. The document is so short that Unicode, Dammit can't get a lock on it, and misidentifies it as ISO-8859-7::
ru: Вот документ, написанный на ISO-8859-8. Документ настолько короткий, что Unicode, Dammit не может разобраться и неправильно идентифицирует кодировку как ISO-8859-7::

source: We can fix this by passing in the correct ``from_encoding``::
ru: Мы можем все исправить, передав правильный ``from_encoding``::

source: If you don't know what the correct encoding is, but you know that Unicode, Dammit is guessing wrong, you can pass the wrong guesses in as ``exclude_encodings``::
ru: Если вы не знаете правильную кодировку, но видите, что Unicode, Dammit определяет ее неправильно, вы можете передать ошибочные варианты в ``exclude_encodings``::

source: Windows-1255 isn't 100% correct, but that encoding is a compatible superset of ISO-8859-8, so it's close enough. (``exclude_encodings`` is a new feature in Beautiful Soup 4.4.0.)
ru: Windows-1255 не на 100% подходит, но это совместимое надмножество ISO-8859-8, так что догадка почти верна. (``exclude_encodings`` — это новая функция в Beautiful Soup 4.4.0.)

source: In rare cases (usually when a UTF-8 document contains text written in a completely different encoding), the only way to get Unicode may be to replace some characters with the special Unicode character "REPLACEMENT CHARACTER" (U+FFFD, �). If Unicode, Dammit needs to do this, it will set the ``.contains_replacement_characters`` attribute to ``True`` on the ``UnicodeDammit`` or :py:class:`BeautifulSoup` object. This lets you know that the Unicode representation is not an exact representation of the original—some data was lost. If a document contains �, but ``.contains_replacement_characters`` is ``False``, you'll know that the � was there originally (as it is in this paragraph) and doesn't stand in for missing data.
ru: В редких случаях (обычно когда документ UTF-8 содержит текст в совершенно другой кодировке) единственным способом получить Unicode может оказаться замена некоторых символов специальным символом Unicode"REPLACEMENT CHARACTER" (U+FFFD, �). Если Unicode, Dammit приходится это сделать, он установит атрибут ``.contains_replacement_characters`` в ``True`` для объектов ``UnicodeDammit`` или :py:class:`BeautifulSoup`. Это даст понять, что представление в виде Unicode не является точным представление оригинала, и что некоторые данные потерялись. Если документ содержит �, но ``.contains_replacement_characters`` равен ``False``, вы будете знать, что � был в тексте изначально (как в этом параграфе), а не служит заменой отсутствующим данным.

source: Output encoding
ru: Кодировка вывода

source: When you write out an output document from Beautiful Soup, you get a UTF-8 document, even if the input document wasn't in UTF-8 to begin with. Here's a document written in the Latin-1 encoding::
ru: Когда вы пишете документ из Beautiful Soup, вы получаете документ в UTF-8, даже если он изначально не был в UTF-8. Вот документ в кодировке Latin-1::

source: Note that the <meta> tag has been rewritten to reflect the fact that the document is now in UTF-8.
ru: Обратите внимание, что тег <meta> был переписан, чтобы отразить тот факт, что теперь документ кодируется в UTF-8.

source: If you don't want UTF-8, you can pass an encoding into ``prettify()``::
ru: Если вы не хотите кодировку UTF-8, вы можете передать другую в ``prettify()``::

source: You can also call encode() on the :py:class:`BeautifulSoup` object, or any element in the soup, just as if it were a Python string::
ru: Вы также можете вызвать encode() для объекта :py:class:`BeautifulSoup` или любого элемента в супе, как если бы это была строка Python::

source: Any characters that can't be represented in your chosen encoding will be converted into numeric XML entity references. Here's a document that includes the Unicode character SNOWMAN::
ru: Любые символы, которые не могут быть представлены в выбранной вами кодировке, будут преобразованы в числовые коды мнемоник XML. Вот документ, который включает в себя Unicode-символ SNOWMAN (снеговик)::

source: The SNOWMAN character can be part of a UTF-8 document (it looks like ☃), but there's no representation for that character in ISO-Latin-1 or ASCII, so it's converted into "&#9731" for those encodings::
ru: Символ SNOWMAN может быть частью документа UTF-8 (он выглядит так: ☃), но в ISO-Latin-1 или ASCII нет представления для этого символа, поэтому для этих кодировок он конвертируется в "&#9731;"::

source: You can use Unicode, Dammit without using Beautiful Soup. It's useful whenever you have data in an unknown encoding and you just want it to become Unicode::
ru: Вы можете использовать Unicode, Dammit без Beautiful Soup. Он полезен в тех случаях, когда у вас есть данные в неизвестной кодировке, и вы просто хотите, чтобы они преобразовались в Unicode::

source: Unicode, Dammit's guesses will get a lot more accurate if you install one of these Python libraries: ``charset-normalizer``, ``chardet``, or ``cchardet``. The more data you give Unicode, Dammit, the more accurately it will guess. If you have your own suspicions as to what the encoding might be, you can pass them in as a list::
ru: Догадки Unicode, Dammit станут намного точнее, если вы установите библиотеки Python ``charset-normalizer``, ``chardet`` или ``cchardet``. Чем больше данных вы даете Unicode, Dammit, тем точнее он определит кодировку. Если у вас есть собственные предположения относительно возможных кодировок, вы можете передать их в виде списка::

source: Unicode, Dammit has two special features that Beautiful Soup doesn't use.
ru: В Unicode, Dammit есть две специальные функции, которые Beautiful Soup не использует.

source: Smart quotes
ru: Парные кавычки

source: You can use Unicode, Dammit to convert Microsoft smart quotes to HTML or XML entities::
ru: Вы можете использовать Unicode, Dammit, чтобы конвертировать парные кавычки (Microsoft smart quotes) в мнемоники HTML или XML::

source: You can also convert Microsoft smart quotes to ASCII quotes::
ru: Вы также можете конвертировать парные кавычки в обычные кавычки ASCII::

source: Hopefully you'll find this feature useful, but Beautiful Soup doesn't use it. Beautiful Soup prefers the default behavior, which is to convert Microsoft smart quotes to Unicode characters along with everything else::
ru: Надеюсь, вы найдете эту функцию полезной, но Beautiful Soup не использует ее. Beautiful Soup по умолчанию конвертирует парные кавычки в символы Unicode, как и все остальное::

source: Inconsistent encodings
ru: Несогласованные кодировки

source: Sometimes a document is mostly in UTF-8, but contains Windows-1252 characters such as (again) Microsoft smart quotes. This can happen when a website includes data from multiple sources. You can use ``UnicodeDammit.detwingle()`` to turn such a document into pure UTF-8. Here's a simple example::
ru: Иногда документ кодирован в основном в UTF-8, но содержит символы Windows-1252, такие как, опять-таки, парные кавычки. Такое бывает, когда веб-сайт содержит данные из нескольких источников. Вы можете использовать ``UnicodeDammit.detwingle()``, чтобы превратить такой документ в чистый UTF-8. Вот простой пример::

source: This document is a mess. The snowmen are in UTF-8 and the quotes are in Windows-1252. You can display the snowmen or the quotes, but not both::
ru: В этом документе бардак. Снеговики в UTF-8, а парные кавычки в Windows-1252. Можно отображать или снеговиков, или кавычки, но не то и другое одновременно::
