Repository: authoress/bs4ru
Catalog: doc_bs4_4.13.3/locale/*/LC_MESSAGES/bs4ru.po
Languages: ru

source: These problems are almost never problems with Beautiful Soup itself. This is not because Beautiful Soup is an amazingly well-written piece of software. It's because Beautiful Soup doesn't include any parsing code. Instead, it relies on external parsers. If one parser isn't working on a certain document, the best solution is to try a different parser. See `Installing a parser`_ for details and a parser comparison. If this doesn't help, you might need to inspect the document tree found inside the ``BeautifulSoup`` object, to see where the markup you're looking for actually ended up.
ru: Практически никогда источником этих проблемы не бывает Beautiful Soup. Это не потому, что Beautiful Soup так прекрасно написан. Это потому, что Beautiful Soup не содержит кода, который бы разбирал документ. Beautiful Soup опирается на внешние парсеры. Если один парсер не подходит для разбора документа, лучшим решением будет попробовать другой парсер. В разделе `Установка парсера`_ вы найдете больше информации и таблицу сравнения парсеров.

source: Version mismatch problems
ru: Проблемы несоответствия версий

source: ``SyntaxError: Invalid syntax`` (on the line ``ROOT_TAG_NAME = '[document]'``): Caused by running an old Python 2 version of Beautiful Soup under Python 3, without converting the code.
ru: ``SyntaxError: Invalid syntax`` (в строке ``ROOT_TAG_NAME = '[document]'``) — вызвано запуском устаревшей версии Beautiful Soup на Python 2 под Python 3 без конвертации кода.

source: ``ImportError: No module named HTMLParser`` - Caused by running an old Python 2 version of Beautiful Soup under Python 3.
ru: ``ImportError: No module named HTMLParser`` — вызвано запуском устаревшей версии Beautiful Soup на Python 2 под Python 3.

source: ``ImportError: No module named html.parser`` - Caused by running the Python 3 version of Beautiful Soup under Python 2.
ru: ``ImportError: No module named html.parser`` — вызвано запуском версии Beautiful Soup на Python 3 под Python 2.

source: ``ImportError: No module named BeautifulSoup`` - Caused by running Beautiful Soup 3 code in an environment that doesn't have BS3 installed. Or, by writing Beautiful Soup 4 code without knowing that the package name has changed to ``bs4``.
ru: ``ImportError: No module named BeautifulSoup`` — вызвано запуском кода Beautiful Soup 3 в системе, где BS3 не установлен. Или код писали на Beautiful Soup 4, не зная, что имя пакета сменилось на ``bs4``.

source: ``ImportError: No module named bs4`` - Caused by running Beautiful Soup 4 code in an environment that doesn't have BS4 installed.
ru: ``ImportError: No module named bs4`` — вызвано запуском кода Beautiful Soup 4 в среде, где BS4 не установлен.

source: Parsing XML
ru: Разбор XML

source: By default, Beautiful Soup parses documents as HTML. To parse a document as XML, pass in "xml" as the second argument to the :py:class:`BeautifulSoup` constructor::
ru: По умолчанию Beautiful Soup разбирает документы как HTML. Чтобы разобрать документ в виде XML, передайте "xml" в качестве второго аргумента в конструктор :py:class:`BeautifulSoup`::

source: You'll need to :ref:`have lxml installed <parser-installation>`.
ru: Вам также нужно будет :ref:`установить lxml <parser-installation>`.

source: Other parser problems
ru: Другие проблемы с парсерами

source: If your script works on one computer but not another, or in one virtual environment but not another, or outside the virtual environment but not inside, it's probably because the two environments have different parser libraries available. For example, you may have developed the script on a computer that has lxml installed, and then tried to run it on a computer that only has html5lib installed. See `Differences between parsers`_ for why this matters, and fix the problem by mentioning a specific parser library in the :py:class:`BeautifulSoup` constructor.
ru: Если ваш скрипт работает на одном компьютере, но не работает на другом, или работает в одной виртуальной среде, но не в другой, или работает вне виртуальной среды, но не внутри нее, это, вероятно, потому что в двух средах разные библиотеки парсеров. Например, вы могли разработать скрипт на компьютере с установленным lxml, а затем попытались запустить его на компьютере, где установлен только html5lib. Читайте в разделе `Различия между парсерами`_, почему это важно, и исправляйте проблемы, указывая конкретную библиотеку парсера в конструкторе :py:class:`BeautifulSoup`.

source: Because `HTML tags and attributes are case-insensitive <http://www.w3.org/TR/html5/syntax.html#syntax>`_, all three HTML parsers convert tag and attribute names to lowercase. That is, the markup <TAG></TAG> is converted to <tag></tag>. If you want to preserve mixed-case or uppercase tags and attributes, you'll need to :ref:`parse the document as XML. <parsing-xml>`
ru: Поскольку `HTML-теги и атрибуты нечувствительны к регистру <http://www.w3.org/TR/html5/syntax.html#syntax>`_, все три HTML- парсера конвертируют имена тегов и атрибутов в нижний регистр. Таким образом, разметка <TAG></TAG> преобразуется в <tag></tag>. Если вы хотите сохранить смешанный или верхний регистр тегов и атрибутов, вам нужно :ref:`разобрать документ как XML <parsing-xml>`.

source: Miscellaneous
ru: Прочие ошибки

source: ``UnicodeEncodeError: 'charmap' codec can't encode character '\xfoo' in position bar`` (or just about any other ``UnicodeEncodeError``) - This problem shows up in two main situations. First, when you try to print a Unicode character that your console doesn't know how to display. (See `this page on the Python wiki <http://wiki.python.org/moin/PrintFails>`_ for help.) Second, when you're writing to a file and you pass in a Unicode character that's not supported by your default encoding. In this case, the simplest solution is to explicitly encode the Unicode string into UTF-8 with ``u.encode("utf8")``.
ru: ``UnicodeEncodeError: 'charmap' codec can't encode character '\xfoo' in position bar`` (или практически любая другая ошибка ``UnicodeEncodeError``). Эта проблема проявляется в основном в двух ситуациях. Во-первых, когда вы пытаетесь вывести символ Unicode, который ваша консоль не может отобразить, потому что не знает, как. (Смотрите `эту страницу в Python вики <http://wiki.python.org/moin/PrintFails>`_.) Во-вторых, когда вы пишете в файл и передаете символ Unicode, который не поддерживается вашей кодировкой по умолчанию. В этом случае самым простым решением будет явное кодирование строки Unicode в UTF-8 с помощью ``u.encode("utf8")``.

source: ``KeyError: [attr]`` - Caused by accessing ``tag['attr']`` when the tag in question doesn't define the ``attr`` attribute. The most common errors are ``KeyError: 'href'`` and ``KeyError: 'class'``. Use ``tag.get('attr')`` if you're not sure ``attr`` is defined, just as you would with a Python dictionary.
ru: ``KeyError: [attr]`` — вызывается при обращении к ``tag['attr']``, когда в искомом теге не определен атрибут ``attr``. Наиболее типичны ошибки ``KeyError: 'href'`` и ``KeyError: 'class'``. Используйте ``tag.get('attr')``, если вы не уверены, что ``attr`` определен — так же, как если бы вы работали со словарем Python.

source: ``AttributeError: 'ResultSet' object has no attribute 'foo'`` - This usually happens because you expected ``find_all()`` to return a single tag or string. But ``find_all()`` returns a *list* of tags and strings—a ``ResultSet`` object. You need to iterate over the list and look at the ``.foo`` of each one. Or, if you really only want one result, you need to use ``find()`` instead of ``find_all()``.
ru: ``AttributeError: 'ResultSet' object has no attribute 'foo'`` — это обычно происходит тогда, когда вы ожидаете, что ``find_all()`` вернет один тег или строку. Но ``find_all()`` возвращает *список* тегов и строк в объекте ``ResultSet``. Вам нужно перебрать список и поискать ``.foo`` в каждом из элементов. Или, если вам действительно нужен только один результат, используйте ``find()`` вместо ``find_all()``.

source: ``AttributeError: 'NoneType' object has no attribute 'foo'`` - This usually happens because you called ``find()`` and then tried to access the ``.foo`` attribute of the result. But in your case, ``find()`` didn't find anything, so it returned ``None``, instead of returning a tag or a string. You need to figure out why your ``find()`` call isn't returning anything.
ru: ``AttributeError: 'NoneType' object has no attribute 'foo'`` — это обычно происходит, когда вы вызываете ``find()`` и затем пытаетесь получить доступ к атрибуту ``.foo``. Но в вашем случае ``find()`` не нашел ничего, поэтому вернул ``None`` вместо того, чтобы вернуть тег или строку. Вам нужно выяснить, почему ``find()`` ничего не возвращает.

source: ``AttributeError: 'NavigableString' object has no attribute 'foo'`` - This usually happens because you're treating a string as though it were a tag. You may be iterating over a list, expecting that it contains nothing but tags, when it actually contains both tags and strings.
ru: ``AttributeError: 'NavigableString' object has no attribute 'foo'`` - Обычно это происходит, потому что вы обрабатываете строку так, будто это тег. Вы можете проходить по списку, предполагая, что он не содержит ничего, кроме тегов, хотя на самом деле он содержит как теги, так и строки.

source: Improving Performance
ru: Повышение производительности

source: Beautiful Soup will never be as fast as the parsers it sits on top of. If response time is critical, if you're paying for computer time by the hour, or if there's any other reason why computer time is more valuable than programmer time, you should forget about Beautiful Soup and work directly atop `lxml <http://lxml.de/>`_.
ru: Beautiful Soup никогда не будет таким же быстрым, как парсеры, на основе которых он работает. Если время отклика критично, если вы платите за компьютерное время по часам, или если есть какая-то другая причина, почему компьютерное время важнее программистского, стоит забыть о Beautiful Soup и работать непосредственно с `lxml <http://lxml.de/>`_.

source: That said, there are things you can do to speed up Beautiful Soup. If you're not using lxml as the underlying parser, my advice is to :ref:`start <parser-installation>`. Beautiful Soup parses documents significantly faster using lxml than using html.parser or html5lib.
ru: Тем не менее, есть вещи, которые вы можете сделать, чтобы ускорить Beautiful Soup. Если вы не используете lxml в качестве основного парсера, самое время :ref:`начать <parser-installation>`. Beautiful Soup разбирает документы значительно быстрее с lxml, чем с html.parser или html5lib.

source: You can speed up encoding detection significantly by installing the `cchardet <http://pypi.python.org/pypi/cchardet/>`_ library.
ru: Вы можете значительно ускорить распознавание кодировок, установив библиотеку `cchardet <http://pypi.python.org/pypi/cchardet/>`_.

source: `Parsing only part of a document`_ won't save you much time parsing the document, but it can save a lot of memory, and it'll make *searching* the document much faster.
ru: `Разбор части документа`_ не сэкономит много времени в процессе разбора, но может сэкономить много памяти, что сделает *поиск* по документу намного быстрее.

source: Translating this documentation
ru: Перевод документации

source: New translations of the Beautiful Soup documentation are greatly appreciated. Translations should be licensed under the MIT license, just like Beautiful Soup and its English documentation are.
ru: Переводы документации Beautiful Soup очень приветствуются. Перевод должен быть лицензирован по лицензии MIT, так же, как сам Beautiful Soup и англоязычная документация к нему.

source: There are two ways of getting your translation into the main code base and onto the Beautiful Soup website:
ru: Есть два способа передать ваш перевод:

source: Create a branch of the Beautiful Soup repository, add your translation, and propose a merge with the main branch, the same as you would do with a proposed change to the source code.
ru: Создайте ветку репозитория Beautiful Soup, добавьте свой перевод и предложите слияние с основной веткой — так же, как вы предложили бы изменения исходного кода.

source: Send a message to the Beautiful Soup discussion group with a link to your translation, or attach your translation to the message.
ru: Отправьте `в дискуссионную группу Beautiful Soup <https://groups.google.com/forum/?fromgroups#!forum/beautifulsoup>`_ сообщение со ссылкой на ваш перевод, или приложите перевод к сообщению.

source: Use the Chinese or Brazilian Portuguese translations as your model. In particular, please translate the source file ``doc/index.rst``, rather than the HTML version of the documentation. This makes it possible to publish the documentation in a variety of formats, not just HTML.
ru: Используйте существующие переводы документации на китайский или португальский в качестве образца. В частности, переводите исходный файл ``doc/index.rst`` вместо того, чтобы переводить HTML-версию документации. Это позволяет публиковать документацию в разных форматах, не только в HTML.

source: Beautiful Soup 3 is the previous release series, and is no longer supported. Development of Beautiful Soup 3 stopped in 2012, and the package was completely discontinued in 2021. There's no reason to install it unless you're trying to get very old software to work, but it's published through PyPi as :py:class:`BeautifulSoup`:
ru: Beautiful Soup 3 — это предыдущая серия релизов, которая больше не поддерживается. Разработка Beautiful Soup 3 остановилась в 2012 году, а выпуск пакетов был полностью прекращен в 2021 году. Нет смысла устанавливать его, если только вы не пытаетесь заставить работать очень старое программное обеспечение. Beautiful Soup 3 опубликован через PyPi как :py:class:`BeautifulSoup`:

source: You can also download `a tarball of the final release, 3.2.2 <https://www.crummy.com/software/BeautifulSoup/download/3.x/BeautifulSoup-3.2.2.tar.gz>`_.
ru: Вы можете скачать `tar-архив последнего релиза, 3.2.2 <https://www.crummy.com/software/BeautifulSoup/download/3.x/BeautifulSoup-3.2.2.tar.gz>`_.

source: If you ran ``pip install beautifulsoup`` or ``pip install BeautifulSoup``, but your code doesn't work, you installed Beautiful Soup 3 by mistake. You need to run ``pip install beautifulsoup4``.
ru: Если вы запустили ``pip install beautifulsoup`` или ``pip install BeautifulSoup``, но ваш код не работает, значит, вы ошибочно установили Beautiful Soup 3. Вам нужно запустить ``pip install beautifulsoup4``.

source: `The documentation for Beautiful Soup 3 is archived online <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_.
ru: Архивная документация для Beautiful Soup 3 доступна `онлайн <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_.

source: Porting code to BS4
ru: Перенос кода на BS4

source: Most code written against Beautiful Soup 3 will work against Beautiful Soup 4 with one simple change. All you should have to do is change the package name from :py:class:`BeautifulSoup` to ``bs4``. So this::
ru: Большая часть кода, написанного для Beautiful Soup 3, будет работать и в Beautiful Soup 4 с одной простой заменой. Все, что вам нужно сделать, это изменить имя пакета c :py:class:`BeautifulSoup` на ``bs4``. Так что это::

source: becomes this::
ru: становится этим::

source: If you get the ``ImportError`` "No module named BeautifulSoup", your problem is that you're trying to run Beautiful Soup 3 code, but you only have Beautiful Soup 4 installed.
ru: Если выводится сообщение ``ImportError`` "No module named BeautifulSoup", ваша проблема в том, что вы пытаетесь запустить код Beautiful Soup 3, в то время как у вас установлен Beautiful Soup 4.

source: If you get the ``ImportError`` "No module named bs4", your problem is that you're trying to run Beautiful Soup 4 code, but you only have Beautiful Soup 3 installed.
ru: Если выводится сообщение ``ImportError`` "No module named bs4", ваша проблема в том, что вы пытаетесь запустить код Beautiful Soup 4, в то время как у вас установлен Beautiful Soup 3.

source: Although BS4 is mostly backward-compatible with BS3, most of its methods have been deprecated and given new names for `PEP 8 compliance <http://www.python.org/dev/peps/pep-0008/>`_. There are numerous other renames and changes, and a few of them break backward compatibility.
ru: Хотя BS4 в основном обратно совместим с BS3, большинство методов BS3 устарели и получили новые имена, чтобы `соответствовать PEP 8 <http://www.python.org/dev/peps/pep-0008/>`_. Некоторые из переименований и изменений нарушают обратную совместимость.

source: Here's what you'll need to know to convert your BS3 code and habits to BS4:
ru: Вот что нужно знать, чтобы перейти с BS3 на BS4:

source: You need a parser
ru: Вам нужен парсер

source: Beautiful Soup 3 used Python's ``SGMLParser``, a module that was deprecated and removed in Python 3.0. Beautiful Soup 4 uses ``html.parser`` by default, but you can plug in lxml or html5lib and use that instead. See `Installing a parser`_ for a comparison.
ru: Beautiful Soup 3 использовал модуль Python ``SGMLParser``, который теперь устарел и был удален в Python 3.0. Beautiful Soup 4 по умолчанию использует ``html.parser``, но вы можете подключить lxml или html5lib вместо него. Вы найдете таблицу сравнения парсеров в разделе `Установка парсера`_.

source: Since ``html.parser`` is not the same parser as ``SGMLParser``, you may find that Beautiful Soup 4 gives you a different parse tree than Beautiful Soup 3 for the same markup. If you swap out ``html.parser`` for lxml or html5lib, you may find that the parse tree changes yet again. If this happens, you'll need to update your scraping code to process the new tree.
ru: Поскольку ``html.parser`` — это не то же, что ``SGMLParser``, вы можете обнаружить, что Beautiful Soup 4 дает другое дерево разбора, чем Beautiful Soup 3. Если вы замените html.parser на lxml или html5lib, может оказаться, что дерево разбора опять изменилось. Если такое случится, вам придется обновить код, чтобы обработать новое дерево.

source: Property names
ru: Имена методов

source: I renamed three attributes to avoid using words that have special meaning to Python. Unlike my changes to method names (which you'll see in the form of deprecation warnings), these changes *did not preserve backwards compatibility.* If you used these attributes in BS3, your code will break in BS4 until you change them.
ru: Я переименовал три атрибута, чтобы избежать использования зарезервированных слов в Python. В отличие от моих изменений в названиях методов (которые вы увидите в виде предупреждений об устаревших методах), эти изменения *не являются обратно совместимыми*. Если вы использовали эти атрибуты в BS3, ваш код не сработает на BS4, пока вы их не измените.

source: Generators
ru: Генераторы

source: Some of the generators used to yield ``None`` after they were done, and then stop. That was a bug. Now the generators just stop.
ru: Некоторые генераторы выдавали ``None`` после их завершения и останавливались. Это была ошибка. Теперь генераторы просто останавливаются.

source: There is no longer a ``BeautifulStoneSoup`` class for parsing XML. To parse XML you pass in "xml" as the second argument to the :py:class:`BeautifulSoup` constructor. For the same reason, the :py:class:`BeautifulSoup` constructor no longer recognizes the ``isHTML`` argument.
ru: Больше нет класса ``BeautifulStoneSoup`` для разбора XML. Чтобы разобрать XML, нужно передать "xml" в качестве второго аргумента в конструктор :py:class:`BeautifulSoup`. По той же причине конструктор :py:class:`BeautifulSoup` больше не распознает аргумент ``isHTML``.

source: Beautiful Soup's handling of empty-element XML tags has been improved. Previously when you parsed XML you had to explicitly say which tags were considered empty-element tags. The ``selfClosingTags`` argument to the constructor is no longer recognized. Instead, Beautiful Soup considers any empty tag to be an empty-element tag. If you add a child to an empty-element tag, it stops being an empty-element tag.
ru: Улучшена обработка пустых тегов XML. Ранее при разборе XML нужно было явно указать, какие теги считать пустыми элементами. Аргумент ``SelfClosingTags`` больше не распознается. Вместо этого Beautiful Soup считает пустым элементом любой тег без содержимого. Если вы добавляете в тег дочерний элемент, тег больше не считается пустым элементом.

source: Entities
ru: Мнемоники

source: An incoming HTML or XML entity is always converted into the corresponding Unicode character. Beautiful Soup 3 had a number of overlapping ways of dealing with entities, which have been removed. The :py:class:`BeautifulSoup` constructor no longer recognizes the ``smartQuotesTo`` or ``convertEntities`` arguments. (`Unicode, Dammit`_ still has ``smart_quotes_to``, but its default is now to turn smart quotes into Unicode.) The constants ``HTML_ENTITIES``, ``XML_ENTITIES``, and ``XHTML_ENTITIES`` have been removed, since they configure a feature (transforming some but not all entities into Unicode characters) that no longer exists.
ru: Входящие мнемоники HTML или XML всегда преобразуются в соответствующие символы Unicode. В Beautiful Soup 3 было несколько перекрывающих друг друга способов взаимодействия с мнемониками. Эти способы удалены. Конструктор :py:class:`BeautifulSoup` больше не распознает аргументы ``smartQuotesTo`` и ``convertEntities``. (В `Unicode, Dammit`_ все еще присутствует ``smart_quotes_to``, но по умолчанию парные кавычки преобразуются в Unicode). Константы ``HTML_ENTITIES``, ``XML_ENTITIES`` и ``XHTML_ENTITIES`` были удалены, так как они служили для настройки функции, которой больше нет (преобразование отдельных мнемоник в символы Unicode).

source: If you want to turn Unicode characters back into HTML entities on output, rather than turning them into UTF-8 characters, you need to use an :ref:`output formatter <output_formatters>`.
ru: Если вы хотите на выходе преобразовать символы Unicode обратно в мнемоники HTML, а не превращать Unicode в символы UTF-8, вам нужно использовать :ref:`средства форматирования вывода <output_formatters>`.

source: :ref:`Tag.string <.string>` now operates recursively. If tag A contains a single tag B and nothing else, then A.string is the same as B.string. (Previously, it was None.)
ru: :ref:`Tag.string <.string>` теперь работает рекурсивно. Если тег А содержит только тег B и ничего больше, тогда значение A.string будет таким же, как B.string. (Раньше это был None.)

source: `Multi-valued attributes`_ like ``class`` have lists of strings as their values, not simple strings. This may affect the way you search by CSS class.
ru: `Многозначные атрибуты`_, такие как ``class``, теперь в качестве значений имеют списки строк, а не простые строки. Это может повлиять на поиск по классу CSS.

source: :py:class:`Tag` objects now implement the ``__hash__`` method, such that two :py:class:`Tag` objects are considered equal if they generate the same markup. This may change your script's behavior if you put :py:class:`Tag` objects into a dictionary or set.
ru: Объекты :py:class:`Tag` теперь реализуют метод ``__hash__``, так что два объекта :py:class:`Tag` считаются равными, если они генерируют одинаковую разметку. Это может изменить поведение вашего скрипта, если вы поместите объект :py:class:`Tag` в словарь (dictionary) или множество (set).
