Repository: authoress/bs4ru
Catalog: doc_bs4_4.13.3/locale/*/LC_MESSAGES/bs4ru.po
Languages: ru

source: A :py:class:`NavigableString` subclass that represents embedded Javascript; that is, any strings found inside a ``<script>`` tag during document parsing.
ru: Подкласс :py:class:`NavigableString`, представляющий встроенный Javascript, то есть любые строки, найденные при разборе документа внутри тега ``<script>``.

source: A :py:class:`NavigableString` subclass that represents embedded HTML templates; that is, any strings found inside a ``<template>`` tag during document parsing.
ru: Подкласс :py:class:`NavigableString`, представляющий встроенные шаблоны HTML, то есть любые строки, найденные при разборе документа внутри тега ``<template>``.

source: For XML documents
ru: Для документов XML

source: Beautiful Soup defines some :py:class:`NavigableString` classes for holding special types of strings that can be found in XML documents. Like :py:class:`Comment`, these classes are subclasses of :py:class:`NavigableString` that add something extra to the string on output.
ru: Beautiful Soup определяет несколько классов :py:class:`NavigableString` для хранения специальных типов строк, которые можно найти в XML-документах. Как и :py:class:`Comment`, эти классы являются подклассами :py:class:`NavigableString`, которые добавляют что-то в дополнение к выводимой строке.

source: A :py:class:`NavigableString` subclass representing the `declaration <https://www.w3.org/TR/REC-xml/#sec-prolog-dtd>`_ at the beginning of an XML document.
ru: Подкласс :py:class:`NavigableString`, представляющий `объявление <https://www.w3.org/TR/REC-xml/#sec-prolog-dtd>`_ в начале XML-документа.

source: A :py:class:`NavigableString` subclass representing the `document type declaration <https://www.w3.org/TR/REC-xml/#dt-doctype>`_ which may be found near the beginning of an XML document.
ru: Подкласс :py:class:`NavigableString`, представляющий `объявление типа документа <https://www.w3.org/TR/REC-xml/#dt-doctype>`_, которое можно найти в начале XML-документа.

source: A :py:class:`NavigableString` subclass that represents a `CData section <https://www.w3.org/TR/REC-xml/#sec-cdata-sect>`_.
ru: Подкласс :py:class:`NavigableString`, который представляет `раздел CData <https://www.w3.org/TR/REC-xml/#sec-cdata-sect>`_.

source: A :py:class:`NavigableString` subclass that represents the contents of an `XML processing instruction <https://www.w3.org/TR/REC-xml/#sec-pi>`_.
ru: Подкласс :py:class:`NavigableString`, который представляет содержимое `инструкции обработки XML <https://www.w3.org/TR/REC-xml/#sec-pi>`_.

source: Navigating the tree
ru: Навигация по дереву

source: Here's the "Three sisters" HTML document again::
ru: Вернемся к HTML-документу с фрагментом из «Алисы в стране чудес»::

source: I'll use this as an example to show you how to move from one part of a document to another.
ru: Я буду использовать его в качестве примера, чтобы показать, как перейти от одной части документа к другой.

source: Going down
ru: Проход сверху вниз

source: Tags may contain strings and more tags. These elements are the tag's *children*. Beautiful Soup provides a lot of different attributes for navigating and iterating over a tag's children.
ru: Теги могут содержать строки и другие теги. Эти элементы являются дочерними (*children*) для тега. Beautiful Soup предоставляет множество различных атрибутов для навигации и перебора дочерних элементов.

source: Note that Beautiful Soup strings don't support any of these attributes, because a string can't have children.
ru: Обратите внимание, что строки Beautiful Soup не поддерживают ни один из этих атрибутов, потому что строка не может иметь дочерних элементов.

source: Navigating using tag names
ru: Навигация с использованием имен тегов

source: The simplest way to navigate the parse tree is to find a tag by name. To do this, you can use the ``find()`` method::
ru: Самый простой способ навигации по дереву разбора — найти тег по имени. Для этого вы можете использовать метод ``find()``::

source: For convenience, just saying the name of the tag you want is equivalent to ``find()`` (if no built-in attribute has that name). If you want the <head> tag, just say ``soup.head``::
ru: Для удобства простое использование имени нужного тега эквивалентно вызову ``find()`` (если ни один встроенный атрибут не имеет такого имени). Если вам нужен тег <head>, просто используйте ``soup.head``::

source: You can use this trick again and again to zoom in on a certain part of the parse tree. This code gets the first <b> tag beneath the <body> tag::
ru: Вы можете повторять этот трюк многократно, чтобы подробнее рассмотреть определенную часть дерева разбора. Следующий код извлекает первый тег <b> внутри тега <body>::

source: ``find()`` (and its convenience equivalent) gives you only the *first* tag by that name::
ru: ``find()`` (и его удобный эквивалент) дает вам только *первый* тег с таким именем::

source: If you need to get *all* the <a> tags, you can use ``find_all()``::
ru: Если вам нужно получить *все* теги <a>, вы можете использовать ``find_all()``::

source: For more complicated tasks, such as pattern-matching and filtering, you can use the methods described in `Searching the tree`_.
ru: Для более сложных задач, таких как сопоставление с образцом и фильтрация, вы можете использовать методы, описанные в разделе `Поиск по дереву`_.

source: ``.contents`` and ``.children``
ru: ``.contents`` и ``.children``

source: A tag's children are available in a list called ``.contents``::
ru: Дочерние элементы доступны в списке под названием ``.contents``::

source: The :py:class:`BeautifulSoup` object itself has children. In this case, the <html> tag is the child of the :py:class:`BeautifulSoup` object.::
ru: Сам объект :py:class:`BeautifulSoup` имеет дочерние элементы. В этом случае тег <html> является дочерним для объекта :py:class:`BeautifulSoup`::

source: A string does not have ``.contents``, because it can't contain anything::
ru: У строки нет ``.contents``, потому что она не может содержать ничего::

source: Instead of getting them as a list, you can iterate over a tag's children using the ``.children`` generator::
ru: Вместо того, чтобы получать дочерние элементы в виде списка, вы можете перебирать их с помощью генератора ``.children``::

source: If you want to modify a tag's children, use the methods described in `Modifying the tree`_. Don't modify the the ``.contents`` list directly: that can lead to problems that are subtle and difficult to spot.
ru: Если вы хотите изменить дочерние элементы тега, используйте методы, описанные в разделе `Изменение дерева`_. Не изменяйте список ``.contents`` напрямую: это может привести к неуловимым проблемам, которые трудно обнаружить.

source: The ``.contents`` and ``.children`` attributes consider only a tag's *direct* children. For instance, the <head> tag has a single direct child—the <title> tag::
ru: Атрибуты ``.contents`` и ``.children`` применяются только в отношении *непосредственных* дочерних элементов тега. Например, тег <head> имеет только один непосредственный дочерний тег <title>::

source: But the <title> tag itself has a child: the string "The Dormouse's story". There's a sense in which that string is also a child of the <head> tag. The ``.descendants`` attribute lets you iterate over *all* of a tag's children, recursively: its direct children, the children of its direct children, and so on::
ru: Но у самого тега <title> есть дочерний элемент: строка "The Dormouse's story". В некотором смысле эта строка также является дочерним элементом тега <head>. Атрибут ``.descendants`` позволяет перебирать *все* дочерние элементы тега рекурсивно: его непосредственные дочерние элементы, дочерние элементы дочерних элементов и так далее::

source: The <head> tag has only one child, but it has two descendants: the <title> tag and the <title> tag's child. The :py:class:`BeautifulSoup` object only has one direct child (the <html> tag), but it has a whole lot of descendants::
ru: У тега <head> есть только один дочерний элемент, но при этом у него два потомка: тег <title> и его дочерний элемент. У объекта :py:class:`BeautifulSoup` только один прямой дочерний элемент (тег <html>), зато множество потомков::

source: If a tag has only one child, and that child is a :py:class:`NavigableString`, the child is made available as ``.string``::
ru: Если у тега есть только один дочерний элемент, и это :py:class:`NavigableString`, его можно получить через ``.string``::

source: If a tag's only child is another tag, and *that* tag has a ``.string``, then the parent tag is considered to have the same ``.string`` as its child::
ru: Если единственным дочерним элементом тега является другой тег, и у этого *другого* тега есть строка ``.string``, то считается, что родительский тег содержит ту же строку ``.string``, что и дочерний тег::

source: If a tag contains more than one thing, then it's not clear what ``.string`` should refer to, so ``.string`` is defined to be ``None``::
ru: Если тег содержит больше чем один элемент, то становится неясным, какая из строк ``.string`` относится и к родительскому тегу, поэтому ``.string`` родительского тега имеет значение ``None``::

source: ``.strings`` and ``stripped_strings``
ru: ``.strings`` и ``.stripped_strings``

source: If there's more than one thing inside a tag, you can still look at just the strings. Use the ``.strings`` generator to see all descendant strings::
ru: Если внутри тега есть более одного элемента, вы все равно можете посмотреть только на строки. Используйте генератор ``.strings``, чтобы увидеть все дочерние строки::

source: Newlines and spaces that separate tags are also strings. You can remove extra whitespace by using the ``.stripped_strings`` generator instead::
ru: Символы новой строки и пробелы, разделяющие теги, также являются строками. Вы можете удалить лишние пробелы, используя генератор ``.stripped_strings``::

source: Here, strings consisting entirely of whitespace are ignored, and whitespace at the beginning and end of strings is removed.
ru: Здесь строки, состоящие исключительно из пробелов, игнорируются, а пробелы в начале и конце строк удаляются.

source: Going up
ru: Проход снизу вверх

source: Continuing the "family tree" analogy, every tag and every string has a *parent*: the tag that contains it.
ru: В продолжение аналогии с «семейным деревом», каждый тег и каждая строка имеет родителя (*parent*): тег, который его содержит.

source: You can access an element's parent with the ``.parent`` attribute. In the example "three sisters" document, the <head> tag is the parent of the <title> tag::
ru: Вы можете получить доступ к родительскому элементу с помощью атрибута ``.parent``. В примере документа с фрагментом из «Алисы в стране чудес» тег <head> является родительским для тега <title>::

source: The title string itself has a parent: the <title> tag that contains it::
ru: Строка заголовка сама имеет родителя: тег <title>, содержащий ее::

source: The parent of a top-level tag like <html> is the :py:class:`BeautifulSoup` object itself::
ru: Родительским элементом тега верхнего уровня, такого как <html>, является сам объект :py:class:`BeautifulSoup`::

source: And the ``.parent`` of a :py:class:`BeautifulSoup` object is defined as None::
ru: И ``.parent`` объекта :py:class:`BeautifulSoup` определяется как None::

source: You can iterate over all of an element's parents with ``.parents``. This example uses ``.parents`` to travel from an <a> tag buried deep within the document, to the very top of the document::
ru: Вы можете перебрать всех родителей элемента с помощью ``.parents``. В следующем примере ``.parents`` используется для перемещения от тега <a>, закопанного глубоко внутри документа, до самого верха документа::

source: The ``.self_and_parents`` generator is a variant of ``.parents`` which gives you the entire ancestry of an element, including the element itself::
ru: Генератор ``.self_and_parents`` является вариантом ``.parents``, он дает вам полную информацию о происхождении элемента, включая сам элемент::

source: Going sideways
ru: Перемещение вбок

source: Consider a simple document like this::
ru: Рассмотрим простой документ::

source: The <b> tag and the <c> tag are at the same level: they're both direct children of the same tag. We call them *siblings*. When a document is pretty-printed, siblings show up at the same indentation level. You can also use this relationship in the code you write.
ru: Тег <b> и тег <c> находятся на одном уровне: они оба непосредственные дочерние элементы одного и того же тега. Мы называем их *одноуровневые*. Когда документ красиво отформатирован, одноуровневые элементы выводятся с одинаковым отступом. Вы также можете использовать это отношение в написанном вами коде.

source: ``.next_sibling`` and ``.previous_sibling``
ru: ``.next_sibling`` и ``.previous_sibling``

source: You can use ``.next_sibling`` and ``.previous_sibling`` to navigate between page elements that are on the same level of the parse tree::
ru: Вы можете использовать ``.next_sibling`` и ``.previous_sibling`` для навигации между элементами страницы, которые находятся на одном уровне дерева разбора::

source: The <b> tag has a ``.next_sibling``, but no ``.previous_sibling``, because there's nothing before the <b> tag *on the same level of the tree*. For the same reason, the <c> tag has a ``.previous_sibling`` but no ``.next_sibling``::
ru: У тега <b> есть ``.next_sibling``, но нет ``.previous_sibling``, потому что нет ничего до тега <b> *на том же уровне дерева*. По той же причине у тега <c> есть ``.previous_sibling``, но нет ``.next_sibling``::

source: The strings "text1" and "text2" are *not* siblings, because they don't have the same parent::
ru: Строки "text1" и "text2" *не являются* одноуровневыми, потому что они не имеют общего родителя::

source: In real documents, the ``.next_sibling`` or ``.previous_sibling`` of a tag will usually be a string containing whitespace. Going back to the "three sisters" document::
ru: В реальных документах ``.next_sibling`` или ``.previous_sibling`` тега обычно будет строкой, содержащей пробелы. Возвращаясь к фрагменту из «Алисы в стране чудес»::

source: You might think that the ``.next_sibling`` of the first <a> tag would be the second <a> tag. But actually, it's a string: the comma and newline that separate the first <a> tag from the second::
ru: Вы можете подумать, что ``.next_sibling`` первого тега <a> должен быть второй тег <a>. Но на самом деле это строка: запятая и перевод строки, отделяющий первый тег <a> от второго::

source: The second <a> tag is then the ``.next_sibling`` of the comma string::
ru: Второй тег <a> на самом деле является ``.next_sibling`` запятой ::

source: ``.next_siblings`` and ``.previous_siblings``
ru: ``.next_siblings`` и ``.previous_siblings``

source: You can iterate over a tag's siblings with ``.next_siblings`` or ``.previous_siblings``::
ru: Вы можете перебрать одноуровневые элементы данного тега с помощью ``.next_siblings`` или ``.previous_siblings``::

source: (If the argument syntax to find tags by their attribute value is unfamiliar, don't worry; this is covered later in :ref:`The keyword arguments <kwargs>`.)
ru: (Если синтаксис аргументов для поиска тегов по значению их атрибута вам незнаком, не волнуйтесь; это описано позже, в разделе :ref:`Именованные аргументы <kwargs>`.)

source: Going back and forth
ru: Проход вперед и назад

source: Take a look at the beginning of the "three sisters" document::
ru: Взгляните на начало фрагмента из «Алисы в стране чудес»::

source: An HTML parser takes this string of characters and turns it into a series of events: "open an <html> tag", "open a <head> tag", "open a <title> tag", "add a string", "close the <title> tag", "open a <p> tag", and so on. The order in which the opening tags and strings are encountered is called *document order*. Beautiful Soup offers tools for searching a document's elements in document order.
ru: HTML-парсер берет эту строку символов и превращает ее в серию событий: "открыть тег <html>", "открыть тег <head>", "открыть тег <html>", "добавить строку", "закрыть тег <title>", "открыть тег <p>" и так далее. Порядок, в котором встречаются открывающие теги и строки, называется *порядком документа*. Beautiful Soup предлагает инструменты для поиска элементов документа в порядке документа.

source: ``.next_element`` and ``.previous_element``
ru: ``.next_element`` и ``.previous_element``

source: The ``.next_element`` attribute of a string or tag points to whatever was parsed immediately after the opening of the current tag or after the current string. It might be the same as ``.next_sibling``, but it's usually drastically different.
ru: Атрибут ``.next_element`` строки или тега указывает на то, что было разобрано непосредственно после открытия текущего тега или после текущей строки. Это может оказаться тем же, что и ``.next_sibling``, но обычно результат резко отличается.

source: Here's the final <a> tag in the "three sisters" document. Its ``.next_sibling`` is a string: the conclusion of the sentence that was interrupted by the start of the <a> tag::
ru: Возьмем последний тег <a> в фрагменте из «Алисы в стране чудес». Его ``.next_sibling`` является строкой: конец предложения, которое было прервано началом тега <a>::

source: But the ``.next_element`` of that <a> tag, the thing that was parsed immediately after the <a> tag, is *not* the rest of that sentence: it's the string "Tillie" inside it::
ru: Но ``.next_element`` этого тега <a> — это то, что было разобрано сразу после тега <a>, *не* остальная часть этого предложения: это строка "Tillie" внутри тега::

source: That's because in the original markup, the word "Tillie" appeared before that semicolon. The parser encountered an <a> tag, then the word "Tillie", then the closing </a> tag, then the semicolon and rest of the sentence. The semicolon is on the same level as the <a> tag, but the word "Tillie" was encountered first.
ru: Это потому, что в оригинальной разметке слово «Tillie» появилось перед точкой с запятой. Парсер обнаружил тег <a>, затем слово «Tillie», затем закрывающий тег </a>, затем точку с запятой и оставшуюся часть предложения. Точка с запятой находится на том же уровне, что и тег <a>, но слово «Tillie» встретилось первым.

source: The ``.previous_element`` attribute is the exact opposite of ``.next_element``. It points to the opening tag or string that was parsed immediately before this one::
ru: Атрибут ``.previous_element`` является полной противоположностью ``.next_element``. Он указывает на открывающий тег или строку, которые встретились при разборе непосредственно перед текущим элементом::

source: ``.next_elements`` and ``.previous_elements``
ru: ``.next_elements`` и ``.previous_elements``

source: You should get the idea by now. You can use these iterators to move forward or backward in the document as it was parsed::
ru: Вы уже должны были уловить идею. Вы можете использовать их для перемещения вперед или назад по документу, в том порядке, в каком он был разобран парсером::

source: Searching the tree
ru: Поиск по дереву

source: Beautiful Soup defines a lot of methods for searching the parse tree, but they're all very similar. I'm going to spend a lot of time explaining the two most popular methods: ``find()`` and ``find_all()``. The other methods take almost exactly the same arguments, so I'll just cover them briefly.
ru: Beautiful Soup определяет множество методов поиска по дереву разбора, но они все очень похожи. Я буду долго объяснять, как работают два самых популярных метода: ``find()`` и ``find_all()``. Прочие методы принимают практически те же самые аргументы, поэтому я расскажу о них вкратце.

source: Once again, I'll be using the "three sisters" document as an example::
ru: И опять, я буду использовать фрагмент из «Алисы в стране чудес» в качестве примера::

source: By passing in a filter to a method like ``find_all()``, you can zoom in on the parts of the document you're interested in.
ru: Передав фильтр в метод типа ``find_all()``, вы можете углубиться в интересующие вас части документа.

source: Kinds of filters
ru: Виды фильтров

source: Before talking in detail about ``find_all()`` and similar methods, I want to show examples of different filters you can pass into these methods. These filters show up again and again, throughout the search API. You can use them to filter based on a tag's name, on its attributes, on the text of a string, or on some combination of these.
ru: Прежде чем подробно рассказывать о ``find_all()`` и подобных методах, я хочу показать примеры различных фильтров, которые вы можете передать в эти методы. Эти фильтры появляются снова и снова в поисковом API. Вы можете использовать их для фильтрации по имени тега, по его атрибутам, по тексту строки или по некоторой их комбинации.

source: A string
ru: Строка

source: The simplest filter is a string. Pass a string to a search method and Beautiful Soup will perform a tag-name match against that exact string. This code finds all the <b> tags in the document::
ru: Самый простой фильтр — это строка. Передайте строку в метод поиска, и Beautiful Soup выполнит поиск соответствия имени тега этой строке. Следующий код находит все теги <b> в документе::

source: If you pass in a byte string, Beautiful Soup will assume the string is encoded as UTF-8. You can avoid this by passing in a Unicode string instead.
ru: Если вы передадите байтовую строку, Beautiful Soup будет считать, что строка кодируется в UTF-8. Вы можете избежать этого, передав вместо нее строку Unicode.

source: A regular expression
ru: Регулярное выражение

source: If you pass in a regular expression object, Beautiful Soup will filter against that regular expression using its ``search()`` method. This code finds all the tags whose names start with the letter "b"; in this case, the <body> tag and the <b> tag::
ru: Если вы передадите объект с регулярным выражением, Beautiful Soup отфильтрует результаты в соответствии с этим регулярным выражением, используя его метод ``search()``. Следующий код находит все теги, имена которых начинаются с буквы "b"; в нашем случае это теги <body> и <b>::

source: This code finds all the tags whose names contain the letter 't'::
ru: Этот код находит все теги, имена которых содержат букву "t"::

source: The value ``True`` matches every tag it can. This code finds *all* the tags in the document, but none of the text strings::
ru: Значение ``True`` соответствует любому тегу. Следующий код находит *все* теги в документе, но не текстовые строки::

source: A function
ru: Функция

source: If none of the other matches work for you, define a function that takes an element as its only argument. The function should return ``True`` if the argument matches, and ``False`` otherwise.
ru: Если ничто из перечисленного вам не подходит, определите функцию, которая принимает элемент в качестве единственного аргумента. Функция должна вернуть ``True``, если аргумент подходит, и ``False``, если нет.

source: Here's a function that returns ``True`` if a tag defines the "class" attribute but doesn't define the "id" attribute::
ru: Вот функция, которая возвращает ``True``, если в теге определен атрибут "class", но не определен атрибут "id"::

source: Pass this function into ``find_all()`` and you'll pick up all the <p> tags::
ru: Передайте эту функцию в ``find_all()``, и вы получите все теги <p>::

source: This function picks up only the <p> tags. It doesn't pick up the <a> tags, because those tags define both "class" and "id". It doesn't pick up tags like <html> and <title>, because those tags don't define "class".
ru: Эта функция выбирает только теги <p>. Она не выбирает теги <a>, поскольку в них определены и атрибут "class" , и атрибут "id". Она не выбирает теги вроде <html> и <title>, потому что в них не определен атрибут "class".
